Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/Resources/Resources.*.resx
Languages: de, fr, ru

# ErrorGetMetaData
source: An error occurs while trying to retrieve MetaData for this update. Try to decline then delete this update. And try to republish the update.
fr: Une erreure est survenue en essayant de retrouvrer les Metadonnées de la mise à jour. Essayez de décliner puis recréer le mise à jour.

# DescriptionApplicabilityMetadata
source: Experienced users can edit metadata defined by the editor.
de: Erfahrene Benutzer können die Metadaten im Editor bearbeiten.
fr: Les utilisateurs expérimentés peuvent éditer les métadonnées définies par l'éditeur.
ru: Экспериментировал пользователи могут редактировать метаданные, определенные в редакторе.

source: errors has been found.
de: fehler gefunden wurde.
fr: erreurs ont été trouvées.
ru: ошибок найден.

source: No error found.
de: Es ist kein Fehler gefunden.
fr: Aucune erreur trouvée.
ru: Ошибка не найдено.

# ErrorSettingMaxCabSize
source: An error occured while setting Max Cab Size.
fr: Une erreur est survenue en changeant la valeur de Max Cab Size.

# MegaBytes
source: MB
fr: Mo

# ChangeMaxCabSizeForFile
source: At least one file's size is greater than the Max Cab Size defined in the Wsus Settings. If you continue, you may receive the error : "Verification of signature failed for file...". You can change this setting here :
fr: Au moins un fichier est plus grand que le paramètre 'Max Cab Size' définie dans WSUS. Si vous continuez, vous pouvez recevoir un message d'erreur : "Verification of signature failed for file...". Vous pouvez modifier ce paramètre içi :

# ChangeMaxCabSizeSetting
source: If you receive an "Verification of signature failed for file...", when you try to publish big file, you can increase the limit set into Wsus.
fr: Si vous recevez le message d'erreur : "Verification of signature failed for file..." lorsque vous essayez de publier un gros fichier, vous pouvez augmenter la limite imposée par WSUS.

# AreYouSureToWantToOverwriteCurrentCertificate
source: You already have a valid certificate. Are you sure to want to overwrite this certificate ?
fr: Vous avez déjà un certificat valide. Etes-vous sûre de vouloir remplacer ce certificat ?

source: Computer
fr: Ordinateur

source: Desktop
fr: Bureau

source: My Documents
fr: Mes Documents

# WPPSetting
source: WPP Settings
fr: Parametrage WPP

# TheFileIsA0ByteFileSize
source: The file is a 0 byte file Size. The download may have failed.
fr: Le fichier a une taille de 0 Octet. Le téléchargement peut avoir échoué.

source: Absent
de: Abwesend
ru: Отсутствует

# DescriptionFileSizePrependRegSz
source: Same as FileSize, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL.
de: Identisch zu Dateigröße, aber der Update Client wird den angegebenen Reg_SZ Wert aus der Registry anhängen, anstelle die CSIDL zu verwenden.
ru: То же что и FileCreated, но клиент добавит указанное значение REG_SZ из реестра вместо CSIDL.

# DescriptionRuleMsiFeatureInstalledForProduct
source: Checks that the specified feature(s) are installed for one (optionally all) of the specified products.
de: Überprüft, ob das/die angegebene(n) Feature (s) für (optional alle) die angegebenen Produkte installiert
ru: Проверяет, что указанная функция(и) устанговлена(ы) для одного (или всех) указанных продуктов.

# ReplicaServer
source: Replica
de: Replikatsserver
ru: Реплика

# RuleMsiFeatureInstalledForProduct
source: MSI Feature Installed for Product
de: Rule Msi Feature Installed For Product
ru: Функции MSI, установленные для продукта
