Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/Resources/Resources.*.resx
Languages: de, fr, ru

# DescriptionIsInstalledWizard
source: Indicate here the rule or rules that allow clients computer to determine if the update is already installed. - Msi Product installed: Checks that the specified product is installed. Only the ProductCode is required, but the other attributes will be checked if they are supplied. - Processor Architecture: Determines whether the processor is x86, x64 or IA64. - Windows Version : Compare's the operating system's version information to specified values. Implemented using Win32 VerifyVersionInfo(). The Comparison attribute applies to MajorVersion, MinorVersion, BuildNumber, ServicePackMajor, and ServicePack Minor. If Comparison is omitted, it is assumed to be set to EqualTo. - Windows Language : Returns true if the operating system is localized to the specified language. Always returns false if the Windows Multilanguage User Interface (MUI) is installed. - File Exists : Checks for the existence of the specified file. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. If other optional metadata are specified, such as Version or Size, they must all match for this applicability rule to return true. - File Exists Prepend RegSz : Same as FileExists, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Version : Compares the specified file's version to the specified four-part version string. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Version Prepend Reg Sz : Same as FileVersion, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Created Date : Compares the specified file's creation date to the specified value. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Created Prepend RegSz : Same as FileCreated, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Modified Date : Compares the specified file's modification date to the specified value. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Modified Prepend RegSz : Same as FileModified, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Size : Compares the specified file's size to the specified value. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Size Prepend RegSz : Same as FileSize, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - Registry Key Exists : Checks for the existence of the specified registry subkey. - Registry Value Exists : Checks for the existence of the specified registry value. Checks the existence of the default value for the subkey when no value is specified. Checks that the value is of a specific type when a type is specified. The type must be REG_SZ if a value is not specified (the type of the default value of a subkey is always REG_SZ). - Reg_Dword Registry Key : Compares a specified REG_DWORD registry value to a specified number. - Reg_Expand_Sz Registry Key : Compares a specified REG_EXPAND_SZ registry value to a specified string. - Reg_Sz Registry Key : Compares a specified REG_SZ registry value to a specified string. - Reg Sz To Version Regsitry Key : Compares a specified REG_SZ registry value to a specified four-part version string. - Wmi Query : Executes a specified WMI query and evaluates to true if one or more results are returned, or false of zero results are returned. * Delete rules at Package level : Allows you to ensure that only the rules that you set here applies. Recommended in the case of custom rules. If you only use the predefined rules in an MSI or MSP, leave unchecked. Click 'Next' to proceed to the next step.
de: Geben Sie hier die Regel oder Regeln an, die Computer ermöglicht festzustellen, ob das Update bereits installiert ist. MSI-Produkt installiert: Prüft, ob das angegebene Produkt installiert ist. Nur der Produkt Code ist erforderlich, aber die anderen Attribute werden geprüft, wenn sie geliefert werden. Prozessor Architektur: Legt fest, ob der Prozessor x86, x64 oder IA64 ist. Windows Version: Vergleicht die Winodws Version mit Win32 VerifyVersionInfo (). Der Vergleich gilt für MajorVersion, MinorVersion, BuildNumber, ServicePackMajor, and ServicePack Minor. Wird der Vergleich weggelassen, wird 'Gleich wie' angenommen. Windows Sprache: Liefert Wahr, wenn das Betriebssystem in der angegebenen Sprache installiert ist. Liefert immer Falsch zurück, wenn das Windows Multilanguage User Interface (MUI) installiert ist. Datei existiert: Überprüft die Existenz der angegebenen Datei. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Wenn andere optionale Metadaten angegeben werden, wie z. B. Version oder Größe, müssen sie alle für die Anwendbarkeit der Regel übereinstimmend Wahr zurück liefern. Datei-Version REG_SZ: Wie Datei existiert, aber der Update Client REG_SZ liest den Wert aus der Registrierung anstelle eines CSIDL aus. Datei-Version: Vergleicht die angegebene Datei-Version mit der angegebenen vierstelligen Versionsnummer. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Datei-Version REG_SZ: Wie Datei existiert, aber der Update Client REG_SZ liest den Wert aus der Registrierung anstelle eines CSIDL aus. Datei Erstellungsdatum: Vergleicht das Erstellungsdatum mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Datei Erstellungsdatum: Wie Datei Erstellungsdatum, aber der Update Client liest den Wert aus der Registrierung anstelle eines CSIDL aus. Datei Bearbeitungsdatum: Vergleicht das Bearbeitungsdatum der Datei mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Datei Bearbeitungsdatum REG_SZ: Wie Datei Bearbeitungsdatum, aber der Update Client liest den REG_SZ Wert aus der Registrierung anstelle eines CSIDL aus. "Dateigröße: Vergleicht die angegebene Dateigröße mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden." Dateigröße REG_SZ: WieDateigröße, aber der Update Client liest den REG_SZ Wert aus der Registrierung anstelle eines CSIDL aus. Registry Key vorhanden: Prüft das Vorhandensein des angegebenen Registrierungsschlüssel. Registry Wert vorhanden: Überprüft die Existenz der angegebenen Registrierungsschlüssel. Prüft die Existenz des Standardwertes für den Schlüssel, wenn kein Wert angegeben wird. Prüft, ob der Wert eines bestimmten Typs ist, wenn ein Typ angegeben ist. Der Typ muss REG_SZ sein, wenn kein Wert angegeben wird (der Typ der Standardwert eines Unterschlüssels ist, ist immer REG_SZ). Registry Schlüssel REG_DWORD: Vergleicht einen angegebenen REG_DWORD Registrierungswert mit einer angegebenen Zeichenfolge. Registry Schlüssel REG_EXPAND_SZ: Vergleicht einen angegebenen REG_EXPAND_SZ Registrierungswert mit einer angegebenen Zeichenfolge. Registry Schlüssel REG_SZ: Vergleicht einen angegebenen REG_SZ Registrierungswert mit einer angegebenen Zeichenfolge. REG _SZ um einen Versions Key zu vergleichen: Vergleicht einen angegebenen REG_SZ Registrierungswert mit einer vierstelligen angegebenen Zeichenfolge. WMI-Abfrage: Führt eine angegebene WMI-Abfrage aus und wertet das Ergebnis als wahr, wenn ein oder mehrere Ergebnisse zurückgegeben werden, oder falsch wenn Null Ergebnisse zurückgegeben werden. Löschen Sie Regeln auf Paket Ebene: Hier können Sie sicherstellen, dass nur die Regeln, die Sie hier festlegen, gelten. Empfohlen im Falle von benutzerdefinierten Regeln. Wenn Sie nur die vordefinierten Regeln in einer MSI-oder MSP benutzen, lassen Sie es deaktiviert. Klick auf Weiter
fr: Indiquez içi la/les règles qui permettrons aux clients de déterminer si la mise à jour est déjà installée. - Produit Msi installé : Vérifie dans la base de registre si le produit est déjà installé en ce basant sur le code MSI. - Architecture du Processeur : Détermine si le processeur est de type x86, x64 ou IA64. * Supprimer les règles au niveau Package : Permet de faire en sorte que seul les règles que vous définissez içi s'applique. Recommendé dans le cas de règles personnalisées. Si vous utilisez uniquement les règles prédéfinies par un package MSI ou MSP, laissez décoché. Cliquez sur 'Suivant' pour passer à la prochaine étape.
ru: Укажите здесь правило или правила, позволяющие клиентским компьютерам определять, установлено обновление или нет. - Msi продукт установлен: Проверяет, установлен ли продукт MSI. необходим только код продукта. Если указаны другие аттрибуты, то они также будут проверены. - Архитектура процессора: Определяет архитектуру процессора - x86, x64 или IA64. - Версия Windows : Сравнивает текущую версию операционной системы с указанным значением. Выполяется с использованием функции Win32 VerifyVersionInfo(). Аттрибут сравнения применим к Мажорной версии, Минорной версии, Номеру сборки, Мажорной и минорной версиям пакета обновления. Если аттрибут сравнения опущен,результатом будет равенство. - Язык Windows :Возвращает true если операционная система локализована для указанного языка. Всегда возвращает false если установлен пакет многоязыкового интерфейса Windows (MUI). - Файл существует : Сравнивает размер файла с заданным значением. Если указан идентификатор CSIDL, клиент MSUS Client вызовет функцию Win32 SHGetFolderPath для получения CSIDL и добавит его к пути нахождения файла. - Файл существует RegSz : То же что и Файл существует, но клиент добавит указанное значение REG_SZ из реестра вместо CSIDL. - Версия файла : Сравнивает версию файла со строкой из четырех частей. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Версия файла Reg Sz : То же что и Версия файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - Дата создания файла : Сравнивает дату создания файла с указанным значением. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Дата создания файла RegSz : То же что и Дата создания файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - Дата изменения файла : Сравнивает дату изменения файла с указанным значением. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Дата изменения файла RegSz : То же что и Дата изменения файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - Размер файла : Сравнивает размер файла с указанным значением. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Размер файла RegSz : То же что и Размер файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - ключ реестра существует : Проверяет наличие указанного подключа реестра. - Значение в реестре существует : Проверяет наличие указанного значения в реестре. Проверяет наличие значения по-умолчанию подключа реестра, когда значение не присвоено. Проверяет, что значение соответствует указанному типу. Тип должен быть REG_SZ если значение не указано (по-умолчанию тип значения всегда REG_SZ). - Ключ реестра Reg_Dword : Сравнивает указанное значение REG_DWORD с указанным числом. - Ключ реестра Reg_Expand_Sz Registry Key : Сравнивает указанное значение REG_EXPAND_SZ с указанной строкой. - Ключ реестра Reg_Sz : Сравнивает указанное значение REG_SZ с указанной строкой. - Ключ реестра Reg Sz : Сравнивает указанное значение REG_SZс указанной строкой из четырех частей. - Запрос Wmi : Выполняет указанный запрос WMI и возвращает true если запрос возвратил один или несколько результатов, или false, если запрос возвратил нулевой результат. * Удалить правила уровня пакета : позволяет Вам удостовериться, что применяются только правила, описанные здесь. рекомендуется в случае создания собственных правил. Если Вы используете предустановленные правила MSI или MSP,оставьте флажок снятым. Нажмите 'Далее' чтобы перейти к следующему шагу.

# DescriptionRuleMsiProductInstalled
source: Checks that the specified product is installed. Only the ProductCode is required, but the other attributes will be checked if they are supplied. Msi code (required): MSI product code for the product to be checked. Format 12345678-1234-1234-1234-123456789012 Max version. (Optional): If present, this specified the maximum version of the product. If not present, there is no maximum version filter. Version Min. (Optional): If present, this specified the minimum version of the product. If not present, there is no minimum version filter. Language (Optional): If present, specifies the language to be filtered on. If not present, all languages are considered valid.
de: Überprüft, ob das angegebene Produkt installiert ist. Nur der Produkt Code ist erforderlich, aber die anderen Attribute werden geprüft, wenn sie geliefert werden werden. MSI Code (Erforderlich): MSI Produkt-Code für das Produkt überprüfen. Format 12345678-1234-1234-1234-123456789012 Maximale Version. (Optional): Falls vorhanden, ist dies die maximale Version des Produkts. Falls nicht vorhanden, gibt es keinen Filter Maximale Version. Minimale Version. (Optional): Falls vorhanden, ist dies die minimale Version des Produkts. Falls nicht vorhanden, gibt es keinen Filter Minimale Version. Sprache (Optional): Falls vorhanden, wird auf die Sprache gefiltert werden. Falls nicht vorhanden, werden alle Sprachen als gültig betrachtet.
fr: Indiquez içi les informations concernant le produit Msi à recherché. Les champs en caractères gras sont obligatoires. Code Msi (Obligatoire) : Code du produit Msi au format 12345678-1234-1234-1234-123456789012 Inverser la règle : Vérifiera que le produit n'est PAS installé. Version Max. (Facultatif) : Spécifie un numéro de version maximal pour le produit installé. Version Min. (Facultatif) : Spécifie un numéro de version minimal pour le produit installé. Language (Facultatif) : Spécifie la langue dans la quelle le produit doit être installé.
ru: Проверяет, установлен ли указанный продукт. Необходим только код продукта. Если другие параметры указаны, то они также будут проверены. Код Msi (Обязательно): Код продукта MSI для проверки. Формат 12345678-1234-1234-1234-123456789012 Максимальная версия. (Дополнительно): Если указано, то принимается максимальной версией продукта. Если не указано, то фильтр по максимальной версии не применяется. Минимальная версия. (Дополнительно): Если указано, то принимается минимальной версией продукта. Если не указано, то фильтр по минимальной версии не применяется. Язык (Дополнительно): Если указано, то осуществляется фильтр по языку. Если не указано, то все языки считаются подходящими.

# DescriptionRuleProcessorArchitecture
source: Checks that the system's processor is the specified architecture.
de: Prüft, ob der Prozessor der angegebenen Architektur entspricht.
fr: Indiquez sur quel architecture le produit peut-être installé.
ru: Проверяетсоответствие процессора указанной архитектуре.

# FileCreated
source: File Created Date
de: Dateierstellungsdatum
fr: Date de création du fichier
ru: Дата создания файла

source: File Created Prepend RegSz
de: Dateierstellungsdatum
fr: Date de création du fichier préfixé par Registre
ru: Дата создания файла из RegSz

source: File Exists
de: Datei existiert
fr: Fichier existe
ru: Наличие файла

source: File Exists Prepend RegSz
de: Datei existiert
fr: Fichier existe préfixer par Registre
ru: Наличие файла из RegSz

# FileModified
source: File Modified Date
de: Dateiänderungsdatum
fr: Date de modification du fichier
ru: Дата изменения файла

source: File Modified Prepend RegSz
de: Dateiänderungsdatum
fr: Date de modification du fichier préfixé par Registre
ru: Дата изменения файла из RegSz

source: File Size
de: Dateigröße
fr: Taille du fichier
ru: Размер файла

source: File Size Prepend RegSz
de: Dateigröße
fr: Taille du fichier préfixé par Registre
ru: Размер файла из RegSz

source: File Version
de: Dateiversion.
fr: Version du fichier
ru: Версия файла

source: File Version Prepend RegSz
de: Dateiversion
fr: Version du fichier préfixé par Registre
ru: Версия файла из RegSz

# FinishedPublishing
source: Sucessfully Published
de: Erfolgreiche Veröffentlichung
fr: Publication terminée
ru: Успешно опубликовано

source: Get Publisher
de: Herausgeber anzeigen
fr: Récupération du Publisher
ru: Получить издателя

source: Msi Application Installable
de: Anwendung installierbar
fr: Application Msi installable
ru: Приложение Msi может быть установлено

source: Msi Application Installed
de: Anwendung installiert
fr: Application Msi installé
ru: Приложение Msi установлено

source: Msi Application Superseded
de: Anwendung ersetzt
fr: Application Msi remplacée
ru: Приложение Msi заменено

source: MSi Component Installed For Product
de: Komponente für Produkt installiert
fr: Composant MSi installé pour le produit
ru: Компонент Msi установлен для продукта

source: Msi Feature Installed for Product
de: Feature für Produkt installiert
fr: Fonctionnalité Msi installée pour le produit
ru: Функция Msi установлена для продукта

source: Msi Patch Installable
de: Installierbarer MSI Patch
fr: Patch Msp installable
ru: Патч Msi может быть установлен

source: Msi Patch Installed
de: MSI Patch installiert
fr: Patch Msp installé
ru: Патч Msi установлен

source: Msi Patch Installed For Product
de: Installierter MSI Patch für das Produkt
fr: Patch Msp installé pour le produit
ru: Патч Msi установлен для продукта

source: Msi Patch Superseded
de: Ersetzter MST Patch
fr: Patch Msp remplacé
ru: Патч Msi заменен

source: Msi Product Installed
de: MSI Produkt installiert
fr: Produit Msi Installé
ru: Продукт Msi установлен

source: Number Of Processor
de: Anzahl der Prozessoren
fr: Nombre de processeur
ru: Номер процессора

source: Populate Package
fr: Création du package
ru: Заполнить пакет

# Processor
source: Processor Architecture
de: Prozessor Architektur
fr: Architecture du processeur
ru: Архитектура процессора

# RegDword
source: Reg_Dword Registry Key
de: Reg_Dword Wert
fr: Valeur Dword du Registre
ru: Ключ реестра Reg_Dword

# RegExpandSz
source: Reg_Expand_Sz Registry Key
de: Reg_Expand_SZ Wert
fr: Valeur Reg_Expand_Sz du Registre
ru: Ключ реестра Reg_Expand_Sz

# RegKeyExists
source: Registry Key Exists
de: Registry Schlüssel existiert
fr: Clé de Registre existe
ru: Ключ реестра существует

# RegKeyLoop
source: Value Of Every sub Reg Key
de: Wert jedes Unterschlüssels
fr: Valeur de toutes les sous clés
ru: Значение каздой ветви ключа реестра

# RegSz
source: Reg_Sz Registry Key
de: Reg_Sz Wert
fr: Valeur Reg_Sz du Registre
ru: Ключ реестра Reg_Sz

# RegSzToVersion
source: Reg Sz To Version Regsitry Key
de: Reg_Sz zu Version Registry Schlüssel
fr: Valeur Reg_Sz du Registre en tant que version
ru: Ключ реестра Reg Sz To Version

source: Saving Package
de: Paket speichern
fr: Sauvegarde du package
ru: Сохранение пакета

source: Windows Language
de: Windows Sprache
fr: Langue de Windows
ru: Язык Windows

source: Windows Version
fr: Version de Windows
ru: Версия Windows

source: Wmi Query
de: WMI Abfrage
fr: Requete Wmi
ru: Запрос WMI

# ComparisonEqualTo
source: Equal To
de: Gleich wie
fr: Egal à
ru: Равен

# ComparisonGreaterThan
source: Greater Than
de: Größer als
fr: Supérieur à
ru: Больше чем

# ComparisonGreaterThanOrEqualTo
source: Greater Than Or Equal To
de: Größer als oder Gleich wie
fr: Supérieur ou égal à
ru: Больше или равен

# ComparisonLessThan
source: Less Than
de: Kleiner als
fr: Inférieur à
ru: Меньше чем
