Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/Resources/Resources.*.resx
Languages: de, fr, ru

# DescriptionRuleWindowsVersion
source: Compare's the operating system's version information to specified values. Implemented using Win32 VerifyVersionInfo(). The Comparison attribute applies to MajorVersion, MinorVersion, BuildNumber, ServicePackMajor, and ServicePack Minor. If Comparison is omitted, it is assumed to be set to EqualTo. You must set at least 'Major Version' and/or 'Product Type'. Caution: A domain controller appear with a 'product' = 'domain controller' and not 'Server'. Comparison: Logical operator comparison. By default, the operator is 'Equal To'. Easy Selection : Presets at your disposal. Major Version: Major version of the operating system. Minor Revision: Minor version of the operating system. Build Number: Build of the Operating System. Product: Determines whether this is a workstation, server or domain controller. Service Pack Major: Major service pack version. Service Pack Minor: Minor service pack version.
de: Windows Version: Vergleicht die Winodws Version mit Win32 VerifyVersionInfo (). Der Vergleich gilt für MajorVersion, MinorVersion, BuildNumber, ServicePackMajor, and ServicePack Minor. Wird der Vergleich weggelassen, wird 'Gleich wie' angenommen. Sie müssen eine 'Major Version und/oder einen 'Produkt Typ' angeben. "Achtung! Ein Domain Controller meldet sich mit dem 'Product' = 'domain controller' und nicht mit 'Server'." "Vergleich: Logischer Vergleichsoperator. Standardeinstellung ist Gleich Wie." Einfach Auswahl: Vorauswahl steht zur Verfügung. Major Version: Major Version des Betriebssystem. "Minor Revision: Minor Versionsnummer des Betriebssystem" Build Nummer: Build Nummer des Betriebssytem Produkt: Ist es eine Workstation, ein Server oder ein Domain Controller Service Pack Major: Service Pack Major Version Service Pack Minor: Service Pack Minor Version
fr: Indiquez la version de Windows sur laquelle le produit peut-être installé. Vous devez paramétrer au moins 'Version Majeur' et/ou 'Produit'. Attention : Un controleur de domaine apparaitra avec un 'Produit' = 'Controleur de domaine' et non pas 'Serveur' Comparaison : Opérateur logique de comparaison. Par défaut, l'opérateur est 'Egal à'. Sélection facile : Présélections à votre disposition. Version Majeur : Version majeur du système d'exploitation. Version Mineur : Version mineur du système d'exploitation. Build Number : Build du système d'exploitation. Produit : Détermine si il s'agit d'une station de travail, d'un serveur ou d'un controleur de domaine. Service Pack Majeur : Version majeur du service pack. Service Pack Mineur : Version mineur du service pack.
ru: Сравнивает текущую версию операционной системы с указанным значением. Выполяется с использованием функции Win32 VerifyVersionInfo(). Аттрибут сравнения применим к Мажорной версии, Минорной версии, Номеру сборки, Мажорной и минорной версиям пакета обновления. Если аттрибут сравнения опущен,результатом будет равенство. Вы должны указать как минимум 'Мажорную версию' и/или 'Тип продукта'. Внимание: Контроллер домена нужно указывать как 'продукт' = 'контроллер домена' , а не 'Сервер'. Сравнение: Логический оператор сравнения. по-умолчанию, 'Равно'. Быстрый выбор: Ваши предустановки. Мажорная версия: Мажорная версия операционной системы. Минорная версия: Минорная версия операционной системы. Номер сборки: Номер сборки операционной системы. Продукт: Определяет, является ли компьютер рабочей станцией, сервером или контроллером домена. Мажорная версия пакета обновления: Мажорная версия пакета обновления. Минорная версия пакета обновления: Минорная версия пакета обновления.

# DescriptionWindowsLanguage
source: Returns true if the operating system is localized to the specified language. Always returns false if the Windows Multilanguage User Interface (MUI) is installed.
de: Windows Sprache: Liefert Wahr, wenn das Betriebssystem in der angegebenen Sprache installiert ist.
fr: Règle basé sur la langue d'installation de Windows. Sélectionnez la langue dans laquelle Windows doit-être installé. Attention : Dans le cas d'une version multilangue de Windows, cette règle sera toujours évalué à 'Vrai'.
ru: Возвращает true если операционная система локализована для указанного языка. Всегда возвращает false если установлен пакет многоязыкового интерфейса Windows (MUI).

# DescriptionFileExists
source: Checks for the existence of the specified file. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. If other optional metadata are specified, such as Version or Size, they must all match for this applicability rule to return true. Known folder (Optional): List of predefined folder whose location may vary from one OS to another. File Path (Required): Full path to the file search (260 characters max.). File Version (optional): File Version. Creation Date (Optional): Creation date of the file. Modified Date (Optional): Modified date of the file. File Size (Optional): Size in bytes of the file. Language (optional): Language of the file.
de: Checks for the existence of the specified file. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. If other optional metadata are specified, such as Version or Size, they must all match for this applicability rule to return true. Bekannter Ordner (optional): Liste von vordefinierten Ordnern, deren Ort abweichend von einer Betriebssystemversion zu anderen sein kann. "Pfad zur Datei (Erforderlich): Voll qualifizierter Pfad zur Datei (260 Zeichen maximal)." Dateiversion (Optional): Dateiversion "Erstellungsdatum (Optional): Erstellungsdatum der Datei." "Änderungsdatum (Optional): Änderungsdatum der Datei." Dateigröße (Optional): Dateigröße in Bytes. Dateisprache (Optional): Dateisprache.
fr: Dossier Standard (Optionnel) : Liste de dossier pré-définis dont l'emplacement peut varier d'un OS à l'autre. Chemin vers le fichier (Obligatoire) : Chemin complet vers le fichier à rechercher (260 caractères max.). Version (Optionnel) : Version du fichier. Date de Création (Optionnel) : Date de création du fichier. Date de Modification (Optionnel) : Date de modification du fichier. Taille (Optionnel) : Taille en octet du fichier. Language (Optionnel) : Language du fichier.
ru: Проверяет наличие указанного файла. Если указан идентификатор CSIDL, клиент MSUS Client вызовет функцию Win32 SHGetFolderPath для получения CSIDL и добавит его к пути нахождения файла. Если указаны другие дополнительные метаданные, такие как версия или размер, все они должны соответствовать применяемому правилу, чтобы операция завершилась успешно. Известная папка (Дополнительно): список файлов, пути к которым могут варьироваться от одной ОС к другой. Путь к файлу (Обязательно): Полный путь к файлу (максимум 260 символов.). Версия файла (Дополнительно): Версия файла. Дата создания (Дополнительно): Дата создания файла. Дата изменения (Дополнительно): дата изменения файла. Размер файла(Дополнительно): Размер файла в байтах. Язык (Дополнительно): Язык файла.

# DescriptionFileVersion
source: Compares the specified file's version to the specified four-part version string. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. Standard folder (Optional) : List of predefined file whose location may vary from one OS to another. Path to the file (Required) : Full path to the file search (260 characters max.). Version (Required) : File Version.
de: Vergleicht die Dateiversion mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Bekannte Ordner (optional): Eine Liste von bekannten Ordnern. "Pfad zur Datei (Erforderlich): Voll qualifizierter Pfad zur Datei (260 Zeichen maximal)." Dateiversion (Erforderlich): Dateiversion
fr: Indiquez içi les informations concernant le fichier à vérifier et ca version. Dossier Standard (Optionnel) : Liste de dossier pré-définis dont l'emplacement peut varier d'un OS à l'autre. Chemin vers le fichier (Obligatoire) : Chemin complet vers le fichier à rechercher (260 caractères max.). Version (Obligatoire) : Version du fichier.
ru: Сравнивает версию файла со строкой из четырех частей. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. Стандартная папка (Дополнительно): список файлов, пути к которым могут варьироваться от одной ОС к другой. Путь к файлу (Обязательно): Полный путь к файлу (максимум 260 символов.). Версия файла (Дополнительно): Версия файла.

# NoDescription
source: No description available.
de: Keine Beschreibung verfügbar
fr: Aucune description disponible.
ru: Описание недоступно.

# UpdatePublished
source: The update has been published.
de: Das Update wurde veröffentlicht.
fr: La mise à jour a été publiée.
ru: Обновление успешно опубликовано.

source: Decline
de: Ablehnen
fr: Refuser
ru: Уменьшение

source: Delete
de: Löschen
fr: Supprimer
ru: Удаление

# DescriptionFileCreated
source: Compares the specified file's creation date to the specified value. If Csidl is specified, the MSUS Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. Standard folder (Optional): List of predefined file whose location may vary from one OS to another. Path to the file (Required): Full path to the file search (260 characters max.).
de: Vergleicht das Dateierstellungsdatum mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Standard Ordner (optional): Liste von vordefinierten Dateien, deren Ort abweichend von einer Betriebssystemversion zu anderen sein kann. "Pfad zur Datei (Erforderlich): Voll qualifizierter Pfad zur Datei (260 Zeichen maximal)."
fr: Indiquez içi les informations concernant le fichier à vérifier et ca date de création. Dossier Standard (Optionnel) : Liste de dossier pré-définis dont l'emplacement peut varier d'un OS à l'autre. Chemin vers le fichier (Obligatoire) : Chemin complet vers le fichier à rechercher (260 caractères max.).
ru: Сравнивает конкретную дату создания файла с заданным значением. Если указан идентификатор CSIDL, клиент MSUS Client вызовет функцию Win32 SHGetFolderPath для получения CSIDL и добавит его к пути нахождения файла. Стандартная папка (Дополнительно): список файлов, пути к которым могут варьироваться от одной ОС к другой. Путь к файлу (Обязательно): Полный путь к файлу (максимум 260 символов.).

# DescriptionFileVersionPrependRegSz
source: Same as FileVersion, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. Standard folder (Optional) : List of predefined file whose location may vary from one OS to another. Path to the file (Required) : Full path to the file search (260 characters max.). Version (Required ): File Version.
de: Identisch zu Dateiversion, aber der Update Client wird den angegebenen Reg_SZ Wert aus der Registry anhängen, anstelle die CSIDL zu verwenden. Bekannte Ordner (optional): Eine Liste von bekannten Ordnern. "Pfad zur Datei (Erforderlich): Voll qualifizierter Pfad zur Datei (260 Zeichen maximal)." Dateiversion (Erforderlich): Dateiversion
fr: Indiquez içi les informations concernant le fichier à vérifier et ca version. Dossier Standard (Optionnel) : Liste de dossier pré-définis dont l'emplacement peut varier d'un OS à l'autre. Chemin vers le fichier (Obligatoire) : Chemin complet vers le fichier à rechercher (260 caractères max.). Version (Obligatoire) : Version du fichier.
ru: То же что и Версия файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. Стандартная папка (Дополнительно): список файлов, пути к которым могут варьироваться от одной ОС к другой. Путь к файлу (Обязательно): Полный путь к файлу (максимум 260 символов.). Версия файла (Дополнительно): Версия файла.

source: Expire
de: Läuft ab
fr: Expirer
ru: Истекает

source: Updates
fr: Mises à jour
ru: Обновления

# WsusConnectionException
source: Failed to connect to the server. Verify that the server is started and connection parameters are valid.
de: Verbindung zum Server fehlgeschlagen. Überprüfen Sie ob der Server gestartet ist und ob die Verbindungsparameter korrekt angegeben sind.
fr: La connexion au serveur à échoué. Verifiez que le serveur est démarré et que les paramètres de connections sont valide.
ru: Невозможно соединиться с сервером. Удостоверьтесь, что сервер запущен и указаны правильные параметры соединения.

source: Downloaded
de: Gedownloadet
fr: Téléchargée
ru: Загружено

source: Failed
de: Fehlgeschlagen
fr: Echouée
ru: Ошибка.

source: Install
de: Installieren
fr: Installation
ru: Установить

source: Installed
de: Installiert
fr: Installée
ru: Установлено

source: Installed, Pending Reboot
de: Installiert, Neustart erforderlich
fr: Installée, en attente de redémarrage
ru: Установлено, ожидается перезагрузка

source: Not Applicable
de: Nicht verfügbar
fr: Non applicable
ru: Не применимо

source: Not Approved
de: Nicht genehmigt
fr: Non Approuvé
ru: Не разрешено

source: Not Installed
de: Nicht installiert
fr: Non installée
ru: Не установлено

source: Uninstall
de: Deinstallieren
fr: Désinstallation
ru: Удалить

source: Unknown
de: Unbekannt
fr: Inconnue
ru: Неизвестно

# EditGroupTypeAnd
source: Do you want to link rules by logical operator "And" ?
de: Möchten Sie 'Und'-Regeln verknüpfen?
fr: Voulez-vous liez les règles par l'opérateur logique "Et" ?
ru: Вы хотите связать правила логическим оператором "И" ?

# EditGroupTypeOr
source: Do you want to link rules by logical operator "Or" ?
de: Möchten Sie 'Oder'-Regeln verknüpfen?
fr: Voulez-vous liez les règles par l'opérateur logique "Ou" ?
ru: Вы хотите связать правила логическим оператором "Или" ?

source: P&ublish
de: Veröffentlichen
fr: Pu&blier
ru: &Опубликовать

source: Revise...
de: Überarbeiten...
fr: Réviser...
ru: Проверка…

source: Update revised.
de: Update überarbeitet.
fr: Mise à jour révisée.
ru: Обновление проверено.

# ApproveForUninstallation
source: Approval For Uninstallation
de: Zur Deinstallation genehmigen
fr: Approuvé pour la désinstallation
ru: Разрешение для удаления

source: Approve For Installation
de: Zur Installation genehmigen
fr: Approuvé pour l'installation
ru: Разрешение для установки

source: Approve For Optional Installation
de: Zur optionalen Installation genehmigen
fr: Approuvé pour l'installation optionnelle
ru: Разрешение для выборочной установки

source: Unchanged
de: Nicht geändert
fr: Inchangé
ru: Не изменено

# NeedServerSettings
source: You need to provide settings for, at least, one server.
de: Sie müssen die Einstellungen für mindestens einen Server bereitstellen.
fr: Vous devez fournir des paramètre pour, au moins un, serveur.
ru: Вам нужно указать, как минимум, настройки сервера.

# CertificateSuccessfullyGenerate
source: The certificate has been successfully generated. Don't forget to restart the Wsus Server.
de: Das Zertifikat wurde erfolgreich erstellt. Vergessen Sie nicht den WSUS neu zu starten.
fr: Le certificat a été généré avec succès. N'oubliez pas de redémarrer le serveur Wsus !
ru: Сертификат успешно сгенерирован. Не забудьте перезапустить сервер Wsus.

# CertificateSuccessfullyLoaded
source: The certificate has been successfully loaded. Don't forget to restart the Wsus Server.
de: Das Zertifikat wurde geladen. Vergessen Sie nicht den WSUS neu zu starten.
fr: Le certificat a été chargé avec succès. N'oubliez pas de redémarrer le serveur Wsus.
ru: Сертификат успешно загружен. Не забудьте перезапустить сервер Wsus.

# CertificateSuccessfullySaved
source: The certificate has been successfully saved.
de: Das Zertifikat wurde gesichert.
fr: Le certificat a été sauvegardé avec succès.
ru: Сертификат успешно сохранен.

# ConnectToWsusFirst
source: Connect to Wsus server first.
de: Zuerst zum WSUS verbinden
fr: Connectez vous d'abord au serveur Wsus.
ru: Сначала подключитесь к серверу WSUS.

source: Approve...
de: Genehmigen...
fr: Approuver...
ru: Разрешение…

source: Approved
de: Genehmigt
fr: Approuvé
ru: Разрешено

source: Declined
de: Abgelehnt
fr: Refusé
ru: Уменьшено

source: Expired
de: Abgelaufen.
fr: Expiré
ru: Истекло

source: Resign
de: Erneut Zertifizieren
fr: Re-signer
ru: Переподписывание

# ResignPackageFailed
source: Resign package failed with error
de: Rezertifizierung fehlgeschlagen, Fehler:
fr: Erreur lors de la re-signature de la mise à jour. Erreur
ru: Переподписывание пакета завершилось с ошибкой

# SuccessfullyResignPackage
source: Package successfully resigned.
de: Paket erfolgreich Re-Signiert.
fr: Mise à jour re-signée avec succès.
ru: Пакет успешно переподписан.

source: Superseded
de: Ersetzt
fr: Remplacé
ru: Заменено

# ComparisonLessThanOrEqualTo
source: Less Than Or Equal To
de: Kleiner als oder gleich wie
fr: Inférieur ou égal à
ru: Меньше или равен

source: Connecting...
de: Verbinden...
fr: Connexion...
ru: Подключение…

# FailedToConnectToServer
source: Failed to connect to the server.
de: Verbindung zum Server fehlgeschlagen.
fr: Echec de connexion au serveur.
ru: Невозможно соединиться с сервером.

source: Command sent.
fr: Commande envoyée.
ru: Команда отправлена.

# Exception
source: Error.
de: Fehler
fr: Erreur.
ru: Ошибка.

source: No Ping.
de: Kein Ping
fr: Pas de Ping.
ru: Нет пинга.

source: Pinging
de: Ping wird ausgeführt
fr: Ping
ru: Отсрочка

source: Sending Command...
de: Kommando senden…
fr: Envoi de la commande...
ru: Отправка команды…

# DescriptionFileExistsPrependRegSz
source: Same as FileExists, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. Hkey_Local_Machine (Mandatory) : Hive of the registry where is the name of the directory. Value (Mandatory): Name of the registry key where is the name of the directory. File Name (Mandatory) : Name of the file to search for (260 char. max.). File Version (Optional) : Version of the file. Creation Date (Optional) : Creation date of the file. Modified Date (Optional) : Modification date of the file. Size (Optional) : Size of the file (bytes). Language (Optional) : Language of the file.
de: Identisch zu Datei existiert, aber der Update Client wird den angegebenen Reg_SZ Wert aus der Registry Hkey_Local_Machine (Mandatory) : Hive of the registry where is the name of the directory. Value (Mandatory): Name of the registry key where is the name of the directory. Dateiname (Erforderlich): Zu suchender Dateiname (260 Zeichen maximal). Dateiversion (Optional): Dateiversion "Erstellungsdatum (Optional): Erstellungsdatum der Datei." "Änderungsdatum (Optional): Änderungsdatum der Datei." Dateigröße (Optional) in Bytes: Sprache (Optional) der Datei:
fr: Hkey_Local_Machine (Obligatoire) : Ruche de la base de régistre où se trouve le nom du répertoire. Valeur (Obligatoire): Nom de la clé de registre où se trouve le nom du répertoire. Nom du fichier (Obligatoire) : Nom du fichier à rechercher (260 caractères max.). Version (Optionnel) : Version du fichier. Date de Création (Optionnel) : Date de création du fichier. Date de Modification (Optionnel) : Date de modification du fichier. Taille (Optionnel) : Taille en octet du fichier. Language (Optionnel) : Language du fichier.
ru: То же что и FileExists, но клиент добавит указанное значение REG_SZ из реестра вместо CSIDL. Hkey_Local_Machine (Обязательно) : Куст реестра, в котором содержится название папки. Значение (Обязательно) : Имя ключа реестра, в котором содержится название папки. Имя файла (Обязательно) : Полный путь к файлу (максимум 260 символов.). Версия файла (Дополнительно): Версия файла. Дата создания (Дополнительно): Дата создания файла. Дата изменения (Дополнительно): дата изменения файла. Размер файла(Дополнительно): Размер файла в байтах. Язык (Дополнительно): Язык файла.

source: Cancelled
de: Abgebrochen
fr: Annuler
ru: Отменено

source: Succeeded
de: Erfolgreich
fr: Succès
ru: Успешно

source: On
de: von
fr: Sur
ru: Вкл

source: Summary
de: Summe
fr: Résumé
ru: Сводка

source: Send "Detect Now"
de: “Detect now” senden
fr: Envoyer "Detect Now"
ru: Отправить команду "Обнаружить сейчас"

source: Send "Report Now"
de: “Report now” senden
fr: Envoyer "Report Now"
ru: Отправить команду "Создать отчет сейчас"

source: Needed but not installed
de: Benötigt, aber nicht installiert
fr: Nécessaire mais non installé
ru: Необходимо, но не установлено.

source: Groups
de: Gruppen
fr: Groupes
ru: Группы

source: All
de: Alle
fr: Tous
ru: Все

# DescriptionRegKeyExists
source: Checks for the existence of the specified registry subkey. For exemple : Software\Microsoft\Windows in HKEY_LOCAL_MACHINE If you want to test the existence of a value such as: SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\{23170F69-40C1-2702-0920-000001000000}\DisplayName in HKEY_LOCAL_MACHINE Then use the rule : "Registry Value Exists".
de: Prüft das Vorhandensein des angegebenen Registrierungsschlüssel. "Beispiel: Software\Microsoft\Windows in HKEY_LOCAL_MACHINE" "Wenn Sie auf Vorhandensein eines Wertes wie SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\{23170F69-40C1-2702-0920-000001000000}\AnzeigeName in HKEY_LOCAL_MACHINE prüfen lassen möchten" dann benutzen Sie die Regel: "Registry Wert existiert".
fr: Vérifie l'éxistence d'une clé de registre spécifique. Par exemple : Software\Microsoft\Windows dans HKEY_LOCAL_MACHINE Si vous souhaitez tester l'éxistence d'une valeur tel que : SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\{23170F69-40C1-2702-0920-000001000000}\DisplayName dans HKEY_LOCAL_MACHINE Alors utilisez la règle : "Valeur de Registre Existe".
ru: Проверяет наличие указанного подключа реестра. Например : Software\Microsoft\Windows in HKEY_LOCAL_MACHINE Если Вы хотите протестировать наличие значения такого как: SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\{23170F69-40C1-2702-0920-000001000000}\DisplayName in HKEY_LOCAL_MACHINE Используйте правило : Registry Value Exists"."
