Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/Resources/Resources.*.resx
Languages: de, fr, ru

# StartService
source: Start Windows Update Service
de: Windows Update Service starten
fr: Démarrer le Service Windows Update
ru: Запустить сервис обновления Windows

# StopService
source: Stop Windows Update Service
de: Windows Update Service beenden
fr: Arrêter le Service Windows Update
ru: Остановить сервис обновления Windows

source: Running
de: Läuft
fr: Démarré
ru: Запущен

source: Stopped
de: Angehalten
fr: Arrêté
ru: Остановлено

# CredentialUseSameAsApplication
source: Features connecting to remote computers will use the same credentials than the application.
de: Es werden die gleichen Authentifizierungsdaten verwendet, wie beim Starten dieser Anwendung.
fr: Les fonctions se connectant aux machines distantes utiliseront les mêmes informations d'identification que l'application.
ru: При подключении к удаленным компьютерам использовать учетные данные приложения.

# CredentialUseSpecified
source: Features connecting to remote computers will use crendentials that have been specified in the options.
de: Es werden die Authentifizierungsdaten verwendet, die in den Optionen hinterlegt sind.
fr: Les fonctions se connectant aux machines distantes utiliseront les informations d'identification spécifiées dans les options.
ru: При подключении к удаленным компьютерам использовать учетные данные, указанные в настройках.

# CredentialWillBeAsk
source: Features connecting to remote computers will ask you for credentials.
de: Sie werden nach Authentifizierungsdaten gefragt.
fr: Les fonctions se connectant aux machines distantes vous demanderont les informations d'identifications.
ru: При подключении к удаленным компьютерам запросить учетные данные.

# CredentialWillUse
source: Features connecting to remote computers will use this login :
de: Geben Sie die Authentifizierungsdaten ein:
fr: Les fonctions se connectant aux machines distantes utiliseront le login suivant :
ru: При подключении к удаленным компьютерам использовать следующее имя пользователя :

source: displayed.
de: angezeigt.
fr: affichés.
ru: отображено.

source: Connected
de: Verbunden
fr: Connecté
ru: Соединение установлено

source: No
de: Nein
fr: Non
ru: Нет

source: Yes
de: Ja
fr: Oui
ru: Да

source: Show WindowsUpdate log
de: WindowsUpdate.log öffnen
fr: Montrer le Journal WindowsUpdate
ru: Показать отчет службы WindowsUpdate

# ComputerUnreachable
source: The computer is unreachable
de: Der Computer ist nicht erreichbar
fr: L'ordinateur est injoingnable.
ru: Компьютер недоступен

source: Show pending updates
de: Ausstehende Updates anzeigen
fr: Montrer les mises à jour en attente
ru: Показать отложенные обновления

source: Pending Updates :
de: Updates die einen Neustart anfordern :
fr: Mises à jour en attentes :
ru: Отложенные обновления :

source: Searching...
de: Suchen…
fr: Recherche...
ru: Поиск…

# ShowInWsusConsole
source: Make it visible in Wsus Console
de: In der WSUS-Konsole anzeigen
fr: Rendre visible dans la console Wsus
ru: Отобразить в консоли WSUS

source: Hide in Wsus console
de: Nicht in der WSUS Konsole anzeigen
fr: Masquer dans la console Wsus
ru: Скрыть консоль WSUS

# SearchPrerequisite
source: Do you want to search which update(s) has mark this update as a prerequisite ?
de: Möchten Sie nach Updates suchen, die dieses Update als Voraussetzung markiert haben?
fr: Voulez-vous rechercher quelles mises à jour ont déclarées cette mise à jour comme prerequis ?
ru: Вы хотите выполнить поиск пакета(ов), необходимых этому пакету для предварительной установки?

source: Unsubscribing...
de: Abonnieren aufheben...
fr: Désinscription...
ru: Отмена подписки…

source: Hidden
de: Verstecken
fr: Masquée
ru: Скрыто

source: Delete Product
de: Produkt löschen
fr: Supprimer le produit
ru: Удалить продукт

source: Deleting Product :
de: Produkt löschen :
fr: Suppression du produit :
ru: Удаление продукта :

# ConnectOrReload
source: &Connect/Reload
de: Verbinden/Neu Laden
fr: (Re)&Connexion
ru: &Подключение/Перезагрузка

# FailToCopyFile
source: Failed to copy the file
de: Kopieren der Datei fehlgeschlagen.
fr: Echec de la copie du fichier
ru: Ошибка копирования файла

# FailedToSendCommand
source: Failed to send the command
de: Fehler beim senden des Kommando.
fr: Echec de l'envoi de la commande
ru: Ошибка отправки команды

source: Install pending updates...
de: Anstehende Updates installieren...
fr: Installer les mises à jour en attente...
ru: Установить отложенные обновления…

source: Install this update...
de: Dieses Update installieren...
fr: Installer cette mise à jour...
ru: Установить это обновление…

# ChangingLanguage
source: Changing language will take effect after restarting the application.
de: Die Anwendung wird neu gestartet, um das Ändern der Spracheinstellung abzuschließen.
fr: Le changement de langue prendra effet après redémarrage de l'application.
ru: Смена языка приведет к перезапуску приложения.

# FailedToLoad
source: Failed to load the file.
de: Fehler beim Laden der Datei.
fr: Echec du chargement du fichier.
ru: Невозможно загрузить файл.

# FailedToSave
source: Failed to save the file.
de: Fehler beim Speichern der Datei.
fr: Echec de la sauvegarde du fichier.
ru: Невозможно сохранить файл.

source: Open saved rules...
de: Gespeicherte Regeln öffnen…
fr: Charger des règles sauvegardées...
ru: Открыть сохраненные правила…

source: Save Rules...
de: Regeln speichern…
fr: Sauvegarder les règles...
ru: Сохранение правил…

# UnableToFindShowPendingUpdates
source: Unable to find the file 'Show Pending Updates.exe' in the Application's folder.
de: 'Show Pending Updates.exe fehlt im Applikationsverzeichnis.
fr: Impossible de trouver le fichier 'Show Pending Updates.exe' dans le répertoire de l'application.
ru: Невозможно найти файл 'Show Pending Updates.exe' в папке приложения.

# AddAutomaticallyThisServer
source: Wsus Server has been detected on this machine, therefore it has been automatically add on the top of the server list. To add other servers go to Tools -> Settings.
de: Ein WSUS ist auf diesem System erkannt worden, deshalb wurde dieser WSUS automatisch an oberste Stelle der Serverliste hinzugefügt. Um andere Server hinzuzufügen, öffnen Sie das Menü Extras > Einstellungen.
fr: Un serveur WSUS a été détecté sur cette machine, elle a donc été automatiquement ajouté en haut de la liste des serveurs. Pour ajouter d'autres serveurs allez dans Outils -> Paramètres.
ru: Сервер Wsus Server был обнаружен на этом компьютере, поэтому он был автоматически добавлен в начало списка серверов. Чтобы добавить другие серверы, перейдите в меню Инструменты -> Настройки.

# AskForSupport
source: You can send support data to the author to help improve this application. Add a comment and click 'Yes' button to send your comment. To see which informations will be sent, click on the link at bottom left. Thank you !
de: Sie können die Informationen an den Autor senden um diese Anwendung zu verbessern. Fügen Sie einen Kommentar hinzu und klicken Sie auf OK um den Kommentar zu senden. Um zu sehen, welche Informationen gesendet werden, klicken Sie bitte unten auf den Link 'Informationen anzeigen'. Vielen Dank für Ihre Beteiligung!
fr: Vous pouvez envoyer des informations au support pour aider à améliorer cette application. Ajoutez un commentaire, et cliquez sur le bouton 'Oui' pour envoyer ces informations. Pour voir quelles informations seront envoyées, cliquez sur le lien en bas à gauche. Merci !
ru: Вы можете отправить данные автору для улучшения этого приложения. Добавьте комментарий и нажмите кнопку 'Да' для его отправки. Чтобы увидеть, какая информация будет отправлена, перейдите по ссылке слева внизу. Спасибо !

# InformationsSent
source: Informations sent. Thank You !
de: Informationen gesendet. Vielen Dank für die Beteiligung!
fr: Informations envoyées. Merci !
ru: Информация отправлена. Спасибо !

# SendingInformations
source: Sending Informations. Please wait...
de: Informationen werden gesendet. Bitte warten…
fr: Envoi des informations. Veuillez patienter...
ru: Отправка информации. Пожалуйста, подождите…

# WentWrong
source: Oups, Something went wrong ! Please, help the author to fix this by sending anonymous debug informations. To see which informations will be send, click on the link at bottom left. Thank you for your participation !
de: Entschuldigung, ein Fehler ist aufgetreten! Bitte helfen Sie dem Autor den Fehler zu korrigieren, indem Sie ihm Informationen senden. Um zu sehen, welche Informationen gesendet werden, klicken Sie bitte unten auf den Link 'Informationen anzeigen'. Vielen Dank für Ihre Beteiligung!
fr: Oups, Quelque chose à mal tourné ! S'il-vous-plait, aidez l'auteur à améliorer ce logiciel en envoyant des informations anonyme. Pour voir quelles informations seront envoyées, cliquez sur le lien en bas à gauche. Merci pour votre participation !
ru: Упс, что то пошло не так! Пожалуйста, помогите автору исправить это, отослав анонимную отладочную информацию. Чтобы увидеть, какая информация будет отправлена, перейдите по ссылке слева внизу. Спасибо за Ваше участие!

# CreateCustomUpdate
source: Create a custom update...
de: Benutzerdefiniertes Update erstellen...
fr: Créer une mise à jour personnalisée...
ru: Создание пользовательского обновления…

# CertificateFailedtoBeLoaded
source: Failed to load the certificate. Check the file.
de: Fehler beim Laden des Zertifikates. Überprüfen Sie die Datei.
fr: Le certificat n'a pas pu être chargé. Vérifiez le fichier.
ru: Невозможно загрузить сертификат. Проверьте файл.

# SolveCertificateProblemBeforePublishing
source: There is a problem with the certificate, solve it before publishing an update.
de: Es besteht ein Problem mit dem Zertifikat, lösen Sie es, vorher ist kein veröffentlichen von Updates möglich.
fr: Il y a un problème avec le certificat, résolvez le avant de publier une mise à jour.
ru: Возникла проюлема с этим сертификатом. Исправьте ее перед публикацией обновления.

# SelectaServerFirst
source: Please, select a server.
de: Wählen Sie einen Server.
fr: Veuillez selectionner un serveur.
ru: Пожалуйста, выберите сервер.

# ServerAndConsoleVersionMismatch
source: Server version is different from console version. You won't be able to publish/revise updates.
de: Die WSUS Server Version unterscheidet sich von der WSUS-Konsole, Sie können keine Updates veröffentlichen/Überarbeiten.
fr: La version du serveur est différente de celle de la console. Vous ne pourrez pas publier/reviser de mises à jour.
ru: Версия сервера отличается от версии консоли. Вы не можете опубликовывать или проверять обновления.

# UninstallationAllowed
source: All selected updates support uninstallation.
de: Alle markierten Updates unterstützen die Deinstallation.
fr: Toutes les mises à jour sélectionnées supportent la désinstallation.
ru: Все выбранные обновления поддерживают удаление.

# UninstallationDisallowed
source: Some selected updates does not support uninstallation.
de: Einige markierte Updates unterstützen die Deinstallation nicht.
fr: Certaines mises à jour sélectionnées ne supportent pas la désinstallation.
ru: Некоторые из выбранных обновлений не поддерживают удаление.

# CleanSoftwareDistributionFolder
source: Clean SoftwareDistribution directory...
de: %WINDIR%\SoftwareDistribution Ordner leeren
fr: Supprimer le répertoire SoftwareDistribution...
ru: Очистка папки SoftwareDistribution...

# CantAddUNCPath
source: You can't add files from an UNC path (Starting by \\server\partage...)
de: Sie können keine Dateien über einen UNC-Pfad hinzufügen. (\\Server\Freigabe)
fr: Vous ne pouvez pas ajouter de fichiers depuis un chemin UNC (commencent par \\server\partage...)
ru: Вы не можете добавлять файлы через путь UNC (Такой как \\server\partage...)

# AdditionnalFileAlreadyExist
source: The following file can't be add because there is another file with this name :
de: Die Datei kann nicht hinzugefügt werden, es existiert bereits eine Datei mit dem gleichen Namen.
fr: Le fichier suivant ne peux pas être ajouté car un fichier porte déjà ce nom :
ru: Следующий файл не будет добавлен, так как существует другой файл с тем же именем :

# NotaPFXFile
source: is not a .PFX file.
de: ist nicht eine .PFX Datei.
fr: n'est pas un fichier .PFX.
ru: это не файл формата .PFX

# AutoApprovalRules
source: Automatic Approval Rules
de: Automatische Genehmigungsregel
fr: Règles d'approbation automatique
ru: Правила автоматического разрешения

# AutoApprovalRulesWillApply
source: Auto-Approval rules will apply to :
de: Automatische Genehmigung gilt für:
fr: Les règles d'approbation automatique s'appliqueront :
ru: Правила автоматического разрешения будут применены к :

source: - Non replica downstream servers.
de: - Nicht-Replika-Downstream-WSUS.
fr: - Aux serveurs aval non réplica.
ru: - Не обнаружено подчиненных серверов репликации

source: - This server.
de: - Diesen WSUS.
fr: - A ce server.
ru: - Этот сервер.

source: Optional
de: Optionalen
fr: Optionnelle
ru: Дополнительно

source: Contains
de: Beinhaltet
fr: Contient
ru: Содержит

# EndsWith
source: End with
de: Endet mit
fr: Fini par
ru: Заканчивается на

source: Is equal to
de: Gleich
fr: Est égale à
ru: Равно

source: Start With
de: Beginnt mit
fr: Commence par
ru: Начать с

source: Current logon user is
de: Derzeit angemeldeter Nutzer ist
fr: L'utilisateur actuellement connecté est
ru: Текущее имя пользователя

# UnableToGetLogonUser
source: Unable to get the current logon user.
de: Der derzeit angemeldete Nutzer kann nicht ermittelt werden.
fr: Impossible de déterminer le nom de l'utilisateur actuellement connecté.
ru: Невозможно получить имя входа для текущего пользователя.

source: Show current logon user
de: Zeige derzeit angemeldeten Nutzer
fr: Afficher le nom de l'utilisateur connecté
ru: Показать имя входа текущего пользователя

# EventFor
source: event(s) for
de: Ereignis(se) für
fr: évènement(s) pour
ru: событие(я) для

source: Show update event history
de: Zeige Updateverlauf
fr: Montrer L'historique des événements
ru: Показать историю событий обновления

# MustBeWsusAdmin
source: You must be part of 'Wsus Administrators' group to perform this operation.
de: Sie müssen Mitglied der Gruppe “WSUS Administratoren” sein, um diese Operation ausführen zu können.
fr: Vous devez faire partie du groupe 'Administrateur Wsus' pour réaliser cette opération.
ru: Вы должны входить в группу 'Администраторы Wsus' чтобы выполнить эту операцию.

# MustHaveAdminPrivileges
source: You must have admin rights on this computer to perform this operation.
de: Sie benötigen administrative Rechte auf dem Computer, um diese Operation durchzuführen.
fr: Vous devez avoir les droits d'administrateur pour pouvoir réaliser cette opération.
ru: У Вас должны быть права администратора на данном компьютере чтобы выполнить эту операцию.

# AlreadyAnUpdateWithThisID
source: There's already an update with this Package ID. No import will be perform.
de: Es gibt bereits ein Update mit dieser Package ID. Der Import wird nicht durchgeführt.
fr: Il y a déjà une mise à jour avec cet identifiant unique. L'import est abandonné.
ru: Уже существует обновление с этим идентификатором пакета. Импорт не будет выполнен.

source: Compressing Files...
de: Komprimiere Dateien...
fr: Compression des fichiers...
ru: Сжвтие файлов…

source: Copying Files...
de: Kopiere Dateien...
fr: Copie des fichiers...
ru: Копирование файлов…

# ErrorImportingUpdate
source: Error when importing Update.
de: Fehler beim Import des Updates.
fr: Une erreur est survenue lors de l'import.
ru: Ошибка импорта обновления.

source: Export this Update...
de: Exportiere dieses Update...
fr: Exporter cette mise à jour...
ru: Экспорт этого обновления…

source: Import an Update...
de: Importiere ein Update...
fr: Importer une mise à jour...
ru: Импорт обновления…

source: Saving MetaData...
de: Speichere MetaDaten.
fr: Sauvegarde des MetaDonnées...
ru: Сохранение метаданных…

source: Select a .CAB file
de: Wählen Sie eine .cab Datei.
fr: Selectionnez un fichier .CAB
ru: Выберите .CAB файл

source: Select one and only one update...
de: Wählen Sie nur ein einziges Update.
fr: Selectionnez une et une seule mise à jour...
ru: Выбор одного и только одного обновления…

source: Update successfully exported.
de: Update erfolgreich exportiert.
fr: Mise à jour exportée.
ru: Обновление успешно экспортировано.

source: Update successfully imported.
de: Update erfolgreich importiert.
fr: Mise à jour importée.
ru: Обновление успешно импортировано.

source: will be rename to
de: wird umbenannt in
fr: va être renommé en
ru: будет переименован(а) в

# NoXMLInThisCab
source: No XML file were found.
de: Keine XML Datei gefunden.
fr: Aucun fichier XML n'a été trouvé.
ru: Не обнаружен XML файл

# ParsingXMLFile
source: Reading XML file...
de: Analysiere XML Datei…
fr: Lecture du fichier XML...
ru: Чтение файла XML…

# UncompressingFile
source: Unpacking file...
de: Entpacke Datei…
fr: Décompression du fichier...
ru: Распаковка файла…

source: Importing
de: Importiere
fr: Importation de
ru: Импорт

source: Published
de: Veröffentlicht
fr: Publié
ru: Опубликовано

source: Publishing
de: Veröffentlichen
fr: Publication de
ru: Публикация

source: Select, at least, one package.
de: Mindestens ein Paket wählen
fr: Selectionnez au moins un paquet.
ru: Выберите как минимум один пакет.

source: Help
de: Hilfe
fr: Aide
ru: Помощь

# AllTasksFinished
source: All tasks have been finished.
de: Alle Aufgaben wurden beendet
fr: Toutes les tâches sont terminées.
ru: Все задачи завершены

source: Aborted
de: Abgebrochen
fr: Abandonné
ru: Остановлено

source: Aborting...
de: Abbruch…
fr: Abandon...
ru: Остановка…

source: Failed to publish.
de: Fehler bei der Veröffentlichung
fr: La publication à échouée.
ru: Невозможно опубликовать.

# DownloadindOf
source: Downloading
de: Herunterladen
fr: Téléchargement de
ru: Загрузка

# DownloadingWithUnkownTotalSize
source: Downloading (Total size unkown)
de: Herunterladen (Gesamtgröße unbekannt)
fr: Téléchargement (Taille total inconnue) de
ru: Загрузка (Общий размер неизвестен)

source: Days
de: Tage
fr: Jours
ru: Дней

source: Months
de: Monate
fr: Mois
ru: Месяцы

source: Weeks
de: Wochen
fr: Semaines
ru: Недели

# DeletionCannotBeCancel
source: Deletion cannot be cancel. Are you sure you want to delete ?
de: Löschen kann nicht abgebrochen werden. Sind Sie sicher, dass Sie Löschen möchten?
fr: La suppression ne peux pas être annulée. Est vous sûr de vouloir supprimer ?
ru: Удаление не может быть отменено. Вы на самом деле хотите удалить ?

source: No update available.
de: Sie verwenden bereits die aktuellste Version.
fr: Aucune mise à jour disponible.
ru: Нет доступных обновлений.

source: Update available.
de: Aktualisierung verfügbar.
fr: Mise à jour disponible.
ru: Доступно обновление.

source: Unable to download the file.
de: Datei kann nicht heruntergeladen werden.
fr: Impossible de télécharger le fichier.
ru: Невозможно скачать файл.

# UpdatedCatalogAvailable
source: An update is available for a/some Catalog(s)... Do you want to see difference between old and new catalogs ?
de: Für einen oder mehrere Kataloge ist ein Update verfügbar… Möchten Sie den Unterschied zwischen dem alten und dem neuen Katalog sehen?
fr: Une mise à jour pour un/des catalogue(s) est disponible... Voulez-vous voir la différence entre les anciens et les nouveaux catalogues ?
ru: Доступно обновление одного или нескольких каталогов... Вы хотите увидеть различия между старым и новым каталогами ?

# MustRunLocallyToGenerateSelfSignedCertificateOn6.3
source: Since Microsoft has disable the ability, for Wsus 6.3 and beyond, to issue a self-signed cerrtificate, you have to run WPP locally on the Wsus server, to allow WPP to generate this certificate.
de: Microsoft hat die Möglichkeit im WSUS 6.3 und neuer entfernt. Sie müssen WPP lokal auf dem WSUS Server starten, um mittels WPP ein Zertifikat zu generieren.
fr: Depuis que Microsoft à désactivé la possibilté de générer un certificat auto-signé dans Wsus 6.3 et au delà, vous devez utiliser WPP sur le serveur Wsus pour que WPP puisse générer ce certificat lui même.
ru: Microsoft в версиях WSUS 6.3 и выше отключил данную возможность. Чтобы выпустить собственный сертификат Вы должны запустить WPP локально на сервере Wsus, и WPP его сгенерирует.

# CantPublishDetectoids
source: "Detectoids" cannot be published or imported in Wsus. If you know how to publish or import Detectoids, please contact the author (package.publisher@free.fr).
de: Detectoids können nicht im WSUS veröffentlicht oder importiert werden. Wenn Sie wissen, wie dies realisiert werden kann, kontaktieren Sie bitte den Autor (package.publisher@free.fr)
fr: Les mises à jour de type : Detectoïds, ne peuvent pas être publiées ou importées dans Wsus. Si vous savez comment publier ou importer ces detectoïds dans Wsus, merci de prendre contact avec l'auteur (package.publisher@free.fr).
ru: Детектоиды (пакеты, которые не содержат код, а служат для обнаружения состояния системы) не могут быть импортированы или опубликованы в WSUS. Если Вы знаете, как это сделать, пожалуйста, свяжитесь с автором (package.publisher@free.fr).

# DontPublishDetectoids
source: Unable to publish Detectoid.
de: Kann Detectoid nicht veröffentlichen.
fr: Impossible de publier un detectoïd.
ru: Невозможно опубликовать Детектоид.

# CreateSupersedingUpdate
source: Create a superseding update...
de: Ersetzendes Update erstellen…
fr: Créer une mise à jour remplacante...
ru: Создание вытесняющего обновления…

# ConfirmeUpdateDeletion
source: Are you sure you want to delete these updates ?
de: Sind Sie sicher, dass diese Updates gelöscht werden sollen?
fr: Est vous sûre de vouloir supprimer ces mises à jour ?
ru: Вы уверены, что хотите удалить эти обновления ?

# CatalogUpdate
source: New catalogs available...
de: Neue Kataloge verfügbar…
fr: Nouveaux catalogues disponibles...
ru: Доступны новые каталоги…

# FailedFTPDownload
source: Failed to download through FTP.
de: Der Download über FTP ist fehlgeschlagen.
fr: Echec de l'opération de téléchargement via FTP.
ru: Невозможно загрузить по FTP.

# FailedFTPUpload
source: Failed to upload through FTP.
de: Der Upload über FTP ist fehlgeschlagen.
fr: Echec de l'opération d'upload via FTP.
ru: Невозможно загрузить на FTP.

# FailedHTTPDownload
source: Failed to download through HTTP.
de: Der Download über HTTP ist fehlgeschlagen.
fr: Echec de l'opération de téléchargement via HTTP.
ru: Невозможно загрузить по HTTP.

# SuccessfullFTPDownload
source: Successful to download through FTP.
de: Der Download über FTP war erfolgreich.
fr: Succès de l'opération de téléchargement via FTP.
ru: Успешная загрузка через FTP.

# SuccessfullFTPUpload
source: Successful to upload through FTP.
de: Der Upload über FTP war erfolgreich.
fr: Succès de l'opération d'upload via FTP.
ru: Успешная выгрузка через FTP.

# SuccessfullHTTPDownload
source: Successful to download through HTTP.
de: Der Download über HTTP war erfolgreich.
fr: Succès de l'opération de téléchargement via HTTP.
ru: Успешная загрузка через HTTP.

source: No new version available.
de: Keine neue Version verfügbar.
fr: Aucune mise à jour du logiciel disponible.
ru: Новая версия недоступна.

# XmlSchemaValidationException
source: An error occurred while checking the meta data of the file you are trying to publish. This problem occurs mostly in publishing invalid MSI or MSP files.
fr: Une erreur est survenue en vérifiant les meta données du fichier que vous essayez de publier. Ce problème survient surtout en publiant des fichiers MSI ou MSP non valide.
ru: Произошла ошибка во время проверки метаданных файла, который Вы пытаетесь опубликовать. Данная проблема обычно возникает при публикации поврежденных файлов MSI или MSP.
