Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/Resources/Resources.*.resx
Languages: de, fr, ru

# DescriptionInformationsWizard
source: Indicate here the informations about the update. Fields in bold are required. Vendor Name (Required): It is here that you define the name of the publisher of the update. For example: Oracle, Sun, Symantec, Adobe ... Product Name (Required): Name of the upgraded product. For example: Java, Endpoint Protection 12, Flash Player ... Title (Required): It is here that you define the title of the update. For example: Java 6 update 31, Symantec Endpoint Protection 12.1 MP1 RU1, Flash Player 11.2.0.233 ... Description (Required): You can specify here information about the update. Such as, improvements, and bug fixes ... More Info URL (Optional): Specify here a URL to a web page giving more information about the update. Support URL (Optional): Specify here a URL to a web page support. May require action by the user: Check the box if the update can request a user action. Requires a network connection: Check if the update requires the network to install. Classification: Impact: Restart behavior: Specify whether the need to update or not to restart the job to complete installation. Id Security Bulletin (Optional): Specify the ID of the security bulletin provided by the publisher. MSRC severity (Optional): Specify the MSRC code provided by the publisher. CVE Id (Optional): Specify the CVE code provided by the publisher. KB Article Id (Optional): Specify the number of KB article. Command line (Optional): Indicate one or more parameters for the file update. Eg /q /s or /silent. For Msi file it is not necessary to specify the option to make the installation silent. Wsus does it automatically. Return codes (Optional) : Only for .EXE files. Meaning of the code return at the end of the installation. Click 'Next' to proceed to the next step.
de: "Geben Sie hier die Informationen über das Update an. Felder in Fett sind Pflichtfelder." Hersteller (Erforderlich): Geben Sie den Hersteller des Update an. Beispiel: Adobe, Oracle, Sun. Produktname (Erforderlich): Geben Sie das Produkt an. Beispiel: Java, Flash Player, Reader. "Updatetitel (Erforderlich): Geben Sie den Titel des Update an. Beispiel: Flash Player 11.2.0.233, Java 6 Update 31" "Beschreibung (Erforderlich): Geben Sie hier eine Beschreibung zu dem Update an. Beispiel: Bugfix, neue Features oder anderes." "Info URL (Optional): Geben Sie hier eine Website mit weiterführenden Informationen zu diesem Update an. " "Support URL (Optional): Geben Sie hier eine Website mit Informationen zum Support zu diesem Update an." "Benutzereingaben erforderlich: Aktivieren Sie diese Checkbox, wenn das Update Benutzereingaben anfodern kann." "Netzwerkverbindung erforderlich: Aktivieren Sie hier wenn die Installation eine Netzwerkverbindung benötigt." Klassifizierung: Auswirkungen: Neustart Verhalten: Neustart ist erforderlich. Knowledgebase-Artikel (Optional): Geben Sie die ID des Knowledgebase-Artikel beim Hersteller an. "Microsoft Security Response Center (MSRC): Geben Sie den MSRC Code an, der vom Herausgeber ausgegeben wurde." CVE Id (optional): Geben Sie den vom Herausgeber veröffentlichten CVE Code an. Knowledgebase-Artikel (Optional): Geben Sie die ID des Knowledgebase-Artikel beim Hersteller an. "Kommandozeilenparameter (Optional): Geben Sie hier einen oder mehrere Parameter für die Installation an. Zum Beispiel /q oder /silent. Bei der Verwendung einer MSI-Datei ist nicht notwendig Parameter für die stille Installation anzugeben, der lokale Windows Update Agent führt die Installation automatisch ohne Benutzeroberfläche durch." "Return Code (Optional): Nur für EXE-Dateien. Evtl. Rückgabewerte am Ende einer erfolgreichen Installation." Klick auf Weiter
fr: Indiquez içi les informations concernant la mise à jour. Les champs en caractères gras sont obligatoires. Editeur (Obligatoire) : C'est içi que vous définissez le nom de l'éditeur de la mise à jour. Par exemple : Oracle, Sun, Symantec, Adobe ... Nom Du Produit (Obligatoire) : Nom du produit mis à jour. Par exemple : Java, Endpoint Protection 12, Flash Player ... Titre (Obligatoire) : C'est içi que vous définissez le titre de la mise à jour. Par exemple : Java 6 update 31, Symantec Endpoint Protection 12.1 RU1 MP1, Flash Player 11.2.0.233... Description (Obligatoire) : Vous pouvez préciser içi des informations concernant la mise à jour. Tels que, les améliorations apportées, les bugs corrigés... URL Plus d'Info (Facultatif) : Précisez içi une URL vers une page web donnant plus d'informations sur la mise à jour. URL du Support (Facultatif) : Précisez içi une URL vers une page web du support. Peut nécessiter une action de l'utilisateur : Cochez la case si la mise à jour peut requérire une intervention de l'utilisateur. Nécessite une connexion réseau : Cochez la case si la mise à jour a besoin du réseau pour s'intaller. Classification : Impact : Comportement de redémarrage : Précisez si la mise à jour à besoin ou non de redémarrer le poste pour finaliser son installation. Id du bulletin de sécurité (Facultatif) : Précisez l'Id du bulletin de sécurité fourni par l'éditeur. Sévérité Msrc (Facultatif) : Précisez le code Msrc fournis par l'éditeur. Id CVE (Facultatif) : Précisez le code CVE fournis par l'éditeur. Id de l'article KB (Facultatif) : Précisez le numéro de KB de l'article. Ligne de commande (Facultatif) : Indiquez un ou plusieurs paramètres pour le fichier de mise à jour. Par exemple /q, /s ou /silent. Pour les fichiers .msi il n'est pas nécessaire de préciser d'option pour rendre l'installation silencieuse. Wsus le fait automatiquement. Codes de retour (Facultatif) : Uniquement pour les fichiers .EXE. Signification du code renvoyé à la fin de l'installation. Cliquez sur 'Suivant' pour passer à la prochaine étape.
ru: Укажите здесь информацию об обновлении. Поля, выделенные жирным шрифтом, обязательны к заполнению. Название производителя (Обязательно): Здесь Вы можете указать производителя обновления. например: Oracle, Sun, Symantec, Adobe ... Имя продукта (Обязательно): Имя обновляемого продукта. Например: Java, Endpoint Protection 12, Flash Player ... Заголовок (Обязательно): Заголовок обновления. Например: Java 6 update 31, Symantec Endpoint Protection 12.1 MP1 RU1, Flash Player 11.2.0.233 ... Описание (Обязательно): Описание обновления. Например: улучшения, исправления ошибок и т.д. ... Ссылка с подробной информацией (Дополнительно): Ссылка на страницу в интернете с информацией об обновлении. Ссылка поддкржки продукта (Дополнительно): Ссылка на страницу поддержки продукта в интернете. Может требовать действий пользователя: Установите флажок, если обновление требует реакции пользователя. Требует сетевое подключение: Установите флажок, если для установки обновления требуется подключение к сети. Классификация: Взаимодействие : Перезагрузка: SУкажите, необходимо ли обновлению для установки перезагрузить компьютер. Номер бюллетеня безопасности (Дополнительно): Номер бюллетеня безопасности, опубликованного производителем. MSRC (Дополнительно): Укажите MSRC код, предоставляемый издателем. CVE (Дополнительно): Укажите CVE код, предоставляемый издателем. KB (Дополнительно): Укажите номер статьи KB. Командная строка (Дополнительно): Укажите параметры строки для обновления. Например /q /s or /silent. Для файла Msi нет необходимости указывать параметр тихой установки. Wsusсделает это автоматически. Коды возврата (Дополнительно): только для файлов .EXE. Представляет код, возвращаемый по окончанию установки. Нажмите 'Далее' чтобы перейти к следующему шагу.

# DescriptionUpdateFileWizard
source: Indicate here the file or files to create the update. Fields in bold are required. Update File (Required): Select a msi, msp or exe file corresponding to the binary update. Additional files (Optional): Select a file or files needed for the application of the update. For example configuration files or answer file. Click 'Next' to proceed to the next step.
de: Geben Sie hier die Datei(n) an um das Update zu erstellen. Felder in fett sind Pflichtfelder. Update Datei (Erforderlich): Wählen Sie ein MSI, MSP oder eine EXE zum erstellen des Update. Zusätzliche Dateien (Optional): Eine oder mehrere Dateien angeben die für das erfolgreiche Update erforderlich sind. Klick auf Weiter
fr: Indiquez içi le/les fichiers pour créer la mise à jour. Les champs en caractères gras sont obligatoires. Fichier de mise à jour (Obligatoire) : Sélectionnez un fichier msi, msp ou exe qui correspond au binaire de la mise à jour. Fichiers additionnels (Facultatif) : Sélectionnez un ou plusieurs fichiers nécessaire à l'application de la mise à jour. Par exemple des fichiers de configuration ou fichier de réponses. Cliquez sur 'Suivant' pour passer à la prochaine étape.
ru: Укажите здесь файлы для создания или обновления. Поля, выделеные жирным шрифтом обязательны для заполнения. Обновляемый файл (Обязательно): Выберите msi, msp или exe файл, которому соответствует двоичное обновление. Дополнительные файлы (Дополнительно): Выберите файл или файлы для обновления приложения. Например, файлы конфигурации или файл ответов. Нажмите 'Далее' tдля перехода к следующему шагу.

# openFileDialogueUpdateFile
source: All accepted files|*.msi;*.msp;*.exe|MSI Files|*.msi|MSP Files|*.msp|EXE Files|*.exe
de: Aktzeptierte Dateien: |*.msi;*.msp;*.exe|MSI Files|*.msi|MSP Files|*.msp|EXE Files|*.exe
fr: Tous les fichiers accepté|*.msi;*.msp;*.exe|Fichiers MSI|*.msi|Fichiers MSP|*.msp|Fichiers EXE|*.exe
ru: Все файлы|*.msi;*.msp;*.exe|Файлы MSI|*.msi|Файлы MSP|*.msp|Файлы EXE|*.exe

# RuleAnd
source: AND
de: Und
fr: ET
ru: ИЛИ

# GroupEnd
source: <End
de: <Ende
fr: <Terminer
ru: <Конец

# RuleOR
source: OR
de: Oder
fr: OU
ru: ИЛИ

# GroupStart
source: <Start
fr: <Commencer
ru: <Начало

source: Arrival Date
de: Eingangsdatum
fr: Date d'arrivé
ru: Дата получения

source: Title
de: Titel
fr: Titre
ru: Заголовок

source: Creation Date
de: Erstellungsdatum
fr: Date de Création
ru: Дата создания

# DescriptionIsInstallableWizard
source: Indicate here the rule or rules that allow clients computer to determine if the update is installable. - Msi Product installed: Checks that the specified product is installed. Only the ProductCode is required, but the other attributes will be checked if they are supplied. - Processor Architecture: Determines whether the processor is x86, x64 or IA64. - Windows Version : Compare's the operating system's version information to specified values. Implemented using Win32 VerifyVersionInfo(). The Comparison attribute applies to MajorVersion, MinorVersion, BuildNumber, ServicePackMajor, and ServicePack Minor. If Comparison is omitted, it is assumed to be set to EqualTo. - Windows Language : Returns true if the operating system is localized to the specified language. Always returns false if the Windows Multilanguage User Interface (MUI) is installed. - File Exists : Checks for the existence of the specified file. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. If other optional metadata are specified, such as Version or Size, they must all match for this applicability rule to return true. - File Exists Prepend RegSz : Same as FileExists, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Version : Compares the specified file's version to the specified four-part version string. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Version Prepend Reg Sz : Same as FileVersion, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Created Date : Compares the specified file's creation date to the specified value. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Created Prepend RegSz : Same as FileCreated, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Modified Date : Compares the specified file's modification date to the specified value. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Modified Prepend RegSz : Same as FileModified, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - File Size : Compares the specified file's size to the specified value. If Csidl is specified, the Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - File Size Prepend RegSz : Same as FileSize, but the MSUS Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. - Registry Key Exists : Checks for the existence of the specified registry subkey. - Registry Value Exists : Checks for the existence of the specified registry value. Checks the existence of the default value for the subkey when no value is specified. Checks that the value is of a specific type when a type is specified. The type must be REG_SZ if a value is not specified (the type of the default value of a subkey is always REG_SZ). - Reg_Dword Registry Key : Compares a specified REG_DWORD registry value to a specified number. - Reg_Expand_Sz Registry Key : Compares a specified REG_EXPAND_SZ registry value to a specified string. - Reg_Sz Registry Key : Compares a specified REG_SZ registry value to a specified string. - Reg Sz To Version Regsitry Key : Compares a specified REG_SZ registry value to a specified four-part version string. - Wmi Query : Executes a specified WMI query and evaluates to true if one or more results are returned, or false of zero results are returned. * Delete rules at Package level : Allows you to ensure that only the rules that you set here applies. Recommended in the case of custom rules. If you only use the predefined rules in an MSI or MSP, leave unchecked. Click 'Next' to proceed to the next step.
de: Geben Sie hier die Regel oder Regeln an, mit der festgestellt werden kann ob das Update installiert werden kann. MSI Produkt installiert: Überprüft, ob das angegebene Produkt installiert ist. Nur der ProductCode ist erforderlich, aber die anderen Attribute werden geprüft, wenn sie geliefert werden werden. Prozessor Architektur: Legt fest, ob der Prozessor x86, x64 oder IA64 ist. Windows Version: Vergleicht die Winodws Version mit Win32 VerifyVersionInfo (). Der Vergleich gilt für MajorVersion, MinorVersion, BuildNumber, ServicePackMajor, and ServicePack Minor. Wird der Vergleich weggelassen, wird 'Gleich wie' angenommen. Windows Sprache: Liefert Wahr, wenn das Betriebssystem in der angegebenen Sprache installiert ist. Liefert immer Falsch zurück, wenn das Windows Multilanguage User Interface (MUI) installiert ist. Datei existiert: Überprüft die Existenz der angegebenen Datei. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Wenn andere optionale Metadaten angegeben werden, wie z. B. Version oder Größe, müssen sie alle für die Anwendbarkeit der Regel übereinstimmend Wahr zurück liefern. Datei existiert REG_SZ: Wie Datei existiert, aber der Update Client liest den Wert aus der Registrierung anstelle eines CSIDL aus. Datei-Version: Vergleicht die angegebene Datei-Version mit der angegebenen vierstelligen Versionsnummer. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Datei-Version REG_SZ: Wie Datei existiert, aber der Update Client REG_SZ liest den Wert aus der Registrierung anstelle eines CSIDL aus. Datei Erstellungsdatum: Vergleicht das Erstellungsdatum mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Datei Erstellungsdatum: Wie Datei Erstellungsdatum, aber der Update Client liest den Wert aus der Registrierung anstelle eines CSIDL aus. Datei Bearbeitungsdatum: Vergleicht das Bearbeitungsdatum der Datei mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Datei Bearbeitungsdatum REG_SZ: Wie Datei Bearbeitungsdatum, aber der Update Client liest den REG_SZ Wert aus der Registrierung anstelle eines CSIDL aus. "Dateigröße: Vergleicht die angegebene Dateigröße mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden." Dateigröße REG_SZ: WieDateigröße, aber der Update Client liest den REG_SZ Wert aus der Registrierung anstelle eines CSIDL aus. Registry Key vorhanden: Prüft das Vorhandensein des angegebenen Registrierungsschlüssel. Registry Wert vorhanden: Überprüft die Existenz der angegebenen Registrierungsschlüssel. Prüft die Existenz des Standardwertes für den Schlüssel, wenn kein Wert angegeben wird. Prüft, ob der Wert eines bestimmten Typs ist, wenn ein Typ angegeben ist. Der Typ muss REG_SZ sein, wenn kein Wert angegeben wird (der Typ der Standardwert eines Unterschlüssels ist, ist immer REG_SZ). Registry Schlüssel REG_DWORD: Vergleicht einen angegebenen REG_DWORD Registrierungswert mit einer angegebenen Zeichenfolge. Registry Schlüssel REG_EXPAND_SZ: Vergleicht einen angegebenen REG_EXPAND_SZ Registrierungswert mit einer angegebenen Zeichenfolge. Registry Schlüssel REG_SZ: Vergleicht einen angegebenen REG_SZ Registrierungswert mit einer angegebenen Zeichenfolge. REG _SZ um einen Versions Key zu vergleichen: Vergleicht einen angegebenen REG_SZ Registrierungswert mit einer vierstelligen angegebenen Zeichenfolge. WMI-Abfrage: Führt eine angegebene WMI-Abfrage aus und wertet das Ergebnis als wahr, wenn ein oder mehrere Ergebnisse zurückgegeben werden, oder falsch wenn Null Ergebnisse zurückgegeben werden. Löschen Sie Regeln auf Paket Ebene: Hier können Sie sicherstellen, dass nur die Regeln, die Sie hier festlegen, gelten. Empfohlen im Falle von benutzerdefinierten Regeln. Wenn Sie nur die vordefinierten Regeln in einer MSI-oder MSP benutzen, lassen Sie es deaktiviert. Klick auf Weiter
fr: Indiquez içi la/les règles qui permettrons aux clients de déterminer si la mise à jour est installable. - Produit Msi installé : Vérifie dans la base de registre si le produit est déjà installé en ce basant sur le code MSI. - Architecture du Processeur : Détermine si le processeur est de type x86, x64 ou IA64. * Supprimer les règles au niveau Package : Permet de faire en sorte que seul les règles que vous définissez içi s'applique. Recommendé dans le cas de règles personnalisées. Si vous utilisez uniquement les règles prédéfinies par un package MSI ou MSP, laissez décoché. Cliquez sur 'Suivant' pour passer à la prochaine étape.
ru: Укажите здесь правило или правила, позволяющие клиентским компьютерам определять, готово ли обновление к установке. - Msi продукт установлен: Проверяет, установлен ли продукт MSI. необходим только код продукта. Если указаны другие аттрибуты, то они также будут проверены. - Архитектура процессора: Определяет архитектуру процессора - x86, x64 или IA64. - Версия Windows : Сравнивает текущую версию операционной системы с указанным значением. Выполяется с использованием функции Win32 VerifyVersionInfo(). Аттрибут сравнения применим к Мажорной версии, Минорной версии, Номеру сборки, Мажорной и минорной версиям пакета обновления. Если аттрибут сравнения опущен,результатом будет равенство. - Язык Windows :Возвращает true если операционная система локализована для указанного языка. Всегда возвращает false если установлен пакет многоязыкового интерфейса Windows (MUI). - Файл существует : Сравнивает размер файла с заданным значением. Если указан идентификатор CSIDL, клиент MSUS Client вызовет функцию Win32 SHGetFolderPath для получения CSIDL и добавит его к пути нахождения файла. - Файл существует RegSz : То же что и Файл существует, но клиент добавит указанное значение REG_SZ из реестра вместо CSIDL. - Версия файла : Сравнивает версию файла со строкой из четырех частей. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Версия файла Reg Sz : То же что и Версия файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - Дата создания файла : Сравнивает дату создания файла с указанным значением. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Дата создания файла RegSz : То же что и Дата создания файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - Дата изменения файла : Сравнивает дату изменения файла с указанным значением. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Дата изменения файла RegSz : То же что и Дата изменения файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - Размер файла : Сравнивает размер файла с указанным значением. Если Csidl указан, клиент вызовет функцию Win32 SHGetFolderPath чтобы получить CSIDL и добавит его к имени файла. - Размер файла RegSz : То же что и Размер файла, но клиент MSUS добавит к имени файла значение REG_SZ из реестра вместо CSIDL. - ключ реестра существует : Проверяет наличие указанного подключа реестра. - Значение в реестре существует : Проверяет наличие указанного значения в реестре. Проверяет наличие значения по-умолчанию подключа реестра, когда значение не присвоено. Проверяет, что значение соответствует указанному типу. Тип должен быть REG_SZ если значение не указано (по-умолчанию тип значения всегда REG_SZ). - Ключ реестра Reg_Dword : Сравнивает указанное значение REG_DWORD с указанным числом. - Ключ реестра Reg_Expand_Sz Registry Key : Сравнивает указанное значение REG_EXPAND_SZ с указанной строкой. - Ключ реестра Reg_Sz : Сравнивает указанное значение REG_SZ с указанной строкой. - Ключ реестра Reg Sz : Сравнивает указанное значение REG_SZс указанной строкой из четырех частей. - Запрос Wmi : Выполняет указанный запрос WMI и возвращает true если запрос возвратил один или несколько результатов, или false, если запрос возвратил нулевой результат. * Удалить правила уровня пакета : позволяет Вам удостовериться, что применяются только правила, описанные здесь. рекомендуется в случае создания собственных правил. Если Вы используете предустановленные правила MSI или MSP,оставьте флажок снятым. Нажмите 'Далее' чтобы перейти к следующему шагу.
