Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/Resources/Resources.*.resx
Languages: de, fr, ru

# DescriptionRegValueExists
source: Checks for the existence of the specified registry value. Checks the existence of the default value for the subkey when no value is specified. Checks that the value is of a specific type when a type is specified. The type must be REG_SZ if a value is not specified (the type of the default value of a subkey is always REG_SZ). Checks the existence of the default value for the subkey when no value is specified. Checks that the value is of a specific type when a type is specified. the type must be REG_SZ if a value is not specified.
de: Registry Wert vorhanden: Überprüft die Existenz der angegebenen Registrierungsschlüssel. Prüft die Existenz des Standardwertes für den Schlüssel, wenn kein Wert angegeben wird. Prüft, ob der Wert eines bestimmten Typs ist, wenn ein Typ angegeben ist. Der Typ muss REG_SZ sein, wenn kein Wert angegeben wird (der Typ der Standardwert eines Unterschlüssels ist, ist immer REG_SZ). Prüft die Existenz des Standardwertes für den Unterschlüssel, wenn kein Wert angegeben wird. Prüft, ob der Wert eines bestimmten Typs ist, wenn ein Typ angegeben ist. Der Typ muss REG_SZ sein, wenn kein Wert angegeben wird.
fr: Vérifie l'existence de la valeur de registre spécifiée. Vérifie l'existence de la valeur par défaut pour la sous-clé quand aucune valeur n'est spécifiée. Vérifie que la valeur est d'un type spécifique quand un type est spécifié. Le type doit être REG_SZ si une valeur n'est pas spécifiée.
ru: Проверяет наличие указанного значения в реестре. Проверяет наличие значения по-умолчанию подключа реестра, когда значение не присвоено. Проверяет, что значение соответствует указанному типу. Тип должен быть REG_SZ если значение не указано (по-умолчанию тип значения всегда REG_SZ). Проверяет наличие значения по-умолчанию подключа реестра, когда значение не присвоено. Проверяет, что значение соответствует указанному типу. Тип должен быть REG_SZ если значение не указано

# RegValueExists
source: Registry Value Exists
de: Registry Wert existiert
fr: Valeur de Registre Existe
ru: Значение в реестре существует

# DescriptionRuleRegDword
source: Compares a specified REG_DWORD registry value to a specified number. SubKey : A registry subkey, such as "Software\Microsoft\Windows". Must be between 1 and 255 characters. Value : A registry value name, such as "CurrentBuildNumber". Must be between 0 and 16383 characters. Data : A REG_DWORD registry value. Must be between 0 and uint.maximum
de: Vergleicht einen angegebenen Registrierungswert REG_DWORD mit einem angegebenen String. Registry Unterschlüssel: Ein Registry Unterschlüssel wie z.B. "Software\Microsoft\Windows". Bis max. 255 Zeichen möglich. Wert: Ein Registry Wertname, wie z.B. "CurrentBuildNumer". Bis max. 16383 Zeichen möglich. Data : A REG_DWORD registry value. Must be between 0 and uint.maximum Daten: Ein REG_DWORD Registry Wert.
fr: Compare un REG_DWORD spécifique de registre avec le nombre spéficié. SubKey : Une sous clé du registre, telle que "Software\Microsoft\Windows". Doit avoir entre 1 et 255 caractères. Valeur : Nom d'une valeur du registre, tel que "CurrentBuildNumber". Doit avoir entre 0 et 16383 caractères. Donnée : Une valeur du registre de type REG_DWORD. Doit être compris entre 0 et uint.Maximum.
ru: Сравнивает указанное значение REG_DWORD суказанной строкой. Подключ : Подключ реестра, такой как Software\Microsoft\Windows". Должне быть длиной от 1 до 255 символов. Значение : Имя значения в реестре, такое как "CurrentBuildNumber". Должно быть длиной от 0 до 16383 символов. Данные : Значение реестра REG_DWORD. Должно быть длиной от 0 до 16383 символов.

# ComparisonBeginsWith
source: Begins With
de: Beginnt mit
fr: Commence par
ru: Начинается с

# ComparisonContains
source: Contains
de: Beinhaltet
fr: Contient
ru: Содержит

# ComparisonEndsWith
source: Ends With
de: Endet mit
fr: Fini par
ru: Заканчивается на

# DescriptionRuleRegExpandSz
source: Compares a specified REG_EXPAND_SZ registry value to a specified string. SubKey : A registry subkey, such as "Software\Microsoft\Windows". Must be between 1 and 255 characters. Value : A registry value name, such as "CurrentBuildNumber". Must be between 0 and 16383 characters. Data : A REG_EXPAND_SZ registry value. Must be between 0 and 16383 characters.
de: Vergleicht einen angegebenen REG_EXPAND_SZ Registry Wert mit einem angegebenen String. Registry Unterschlüssel: Ein Registry Unterschlüssel wie z.B. "Software\Microsoft\Windows". Bis max. 255 Zeichen möglich. Wert: Ein Registry Wertname, wie z.B. "CurrentBuildNumer". Bis max. 16383 Zeichen möglich. Wert: Ein REG_EXPAND_SZ, wie z.B. "CurrentBuildNumer". Bis max. 16383 Zeichen möglich.
fr: Compare un REG_EXPAND_SZ spécifique du registre avec la chaine de caractères spécifiée. SubKey : Une sous clé de registre, telle que "Software\Microsoft\Windows". Doit avoir entre 1 et 255 caractères. Valeur : Nom d'une valeur de registre, tel que "CurrentBuildNumber". Doit avoir entre 0 et 16383 caractères. Donnée : Une valeur de registre de type REG_EXPAND_SZ . Doit avoir entre 1 et 16383 caractères.
ru: Сравнивает указанное значение REG_EXPAND_SZ суказанной строкой. Подключ : Подключ реестра, такой как Software\Microsoft\Windows". Должне быть длиной от 1 до 255 символов. Значение : Имя значения в реестре, такое как "CurrentBuildNumber". Должно быть длиной от 0 до 16383 символов. Данные : Значение реестра REG_EXPAND_SZ. Должно быть длиной от 0 до 16383 символов.

# DescriptionRuleRegSz
source: Compares a specified REG_SZ registry value to a specified string. SubKey : A registry subkey, such as "Software\Microsoft\Windows". Must be between 1 and 255 characters. Value : A registry value name, such as "CurrentBuildNumber". Must be between 0 and 16383 characters. Data : A REG_Sz registry value. Must be between 0 and 16383 characters.
de: Vergleicht einen angegebenen REG_EXPAND_SZ Registry Wert mit einem angegebenen String. Registry Unterschlüssel: Ein Registry Unterschlüssel wie z.B. "Software\Microsoft\Windows". Bis max. 255 Zeichen möglich. Wert: Ein Registry Wertname, wie z.B. "CurrentBuildNumer". Bis max. 16383 Zeichen möglich. Wert: Ein REG_SZ Wert, wie z.B. "CurrentBuildNumer". Bis max. 16383 Zeichen möglich.
fr: Compare un REG_SZ spécifique du registre avec la chaine de caractères spécifiée. SubKey : Une sous clé de registre, telle que "Software\Microsoft\Windows". Doit avoir entre 1 et 255 caractères. Valeur : Nom d'une valeur de registre, tel que "CurrentBuildNumber". Doit avoir entre 0 et 16383 caractères. Donnée : Une valeur de registre de type REG_SZ. Doit avoir entre 1 et 16383 caractères.
ru: Сравнивает указанное значение REG_SZ суказанной строкой. Подключ : Подключ реестра, такой как Software\Microsoft\Windows". Должне быть длиной от 1 до 255 символов. Значение : Имя значения в реестре, такое как "CurrentBuildNumber". Должно быть длиной от 0 до 16383 символов. Данные : Значение реестра REG_SZ. Должно быть длиной от 0 до 16383 символов.

# DescriptionRuleRegSzToVersion
source: Compares a specified REG_SZ registry value to a specified four-part version string. SubKey : A registry subkey, such as "Software\Microsoft\Windows". Must be between 1 and 255 characters. Value : A registry value name, such as "CurrentBuildNumber". Must be between 0 and 16383 characters. Data : A REG_SZ registry value. Should match the pattern 0...65535, 0...65535, 0...65535, 0...65535
de: Vergleicht einen angegebenen REG_SZ Wert mit einem angegebenen Vierstelligen String. Registry Unterschlüssel: Ein Registry Unterschlüssel wie z.B. "Software\Microsoft\Windows". Bis max. 255 Zeichen möglich. Wert: Ein Registry Wertname, wie z.B. "CurrentBuildNumer". Bis max. 16383 Zeichen möglich. Data : A REG_SZ registry value. Should match the pattern 0...65535, 0...65535, 0...65535, 0...65535
fr: Compare un REG_SZ spécifique du registre avec la chaine de caractères en quatre parties spécifiée. SubKey : Une sous clé de registre, telle que "Software\Microsoft\Windows". Doit avoir entre 1 et 255 caractères. Valeur : Nom d'une valeur de registre, tel que "CurrentBuildNumber". Doit avoir entre 0 et 16383 caractères. Donnée : Une valeur de registre de type REG_SZ. Doit correspondre au motif 0...65535, 0...65535, 0...65535, 0...65535
ru: Сравнивает указанное значение реестра REG_SZ с указанной строкой из четырех частей. Подключ : Подключ реестра, такой как Software\Microsoft\Windows". Должне быть длиной от 1 до 255 символов. Значение : Имя значения в реестре, такое как "CurrentBuildNumber". Должно быть длиной от 0 до 16383 символов. Данные : Значение реестра REG_SZ. Должно соответствовать образцу 0...99999, 0...99999, 0...99999, 0...99999"

# DescriptionRuleWmiQuery
source: Executes a specified WMI query and evaluates to true if one or more results are returned, or false of zero results are returned. Namespace (Optional) : The WMI namespace of the request. WqlQuery (Required) : The WMI WQL Query.
de: WMI-Abfrage: Führt eine angegebene WMI-Abfrage aus und wertet das Ergebnis als wahr, wenn ein oder mehrere Ergebnisse zurückgegeben werden, oder falsch wenn Null Ergebnisse zurückgegeben werden. Namensraum (Optional): Angefragter WMI Namensraum WQLQuery (Optional): WMI WQL Abfrage
fr: Exécute la requete WMI spécifiée et renvois vraie si un ou plusieurs résultat sont retournés, sinon faux. Espace de nom (Optionel) : L'espace de nom de la requete WMI. Requete WQL (Requis) : La requete WMI WQL.
ru: Выполняет указанный запрос WMI и возвращает true если возвращен один или несколько результатов, или false, если не было возвращено ни одного результата. Пространство имен (Дополнительно) : Пространство имен WMI запроса. WqlQuery (Обязательно) : Запрос WMI WQL.

# DescriptionRuleMsiPatchInstalledForProduct
source: Checks that the specified patch is installed for the specified product. Patch Code (required) : MSI patch code for the patch whose install status is to be checked. Format 12345678-1234-1234-1234-123456789012 Product Code (required) : MSI product code for the product to be checked. Format 12345678-1234-1234-1234-123456789012 Reverse the rule: If check, evaluates the rule then inverts the result. Max version. (Optional): If present, this specified the maximum version of the product. If not present, there is no maximum version filter. Version Min. (Optional): If present, this specified the minimum version of the product. If not present, there is no minimum version filter. Language (Optional): If present, specifies the language to be filtered on. If not present, all languages are considered valid.
de: Überprüft, ob der angegebene Patch für das angegebene Produkt installiert ist. Patch Code (Erforderlich): MSI Patch-Code für die Patch-Installation, deren Status überprüft werden soll. Format 12345678-1234-1234-1234-123456789012 Produkt Code (Erforderlich): MSI Produkt-Code für das Produkt das überprüft wird. Format 12345678-1234-1234-1234-123456789012 Regel umkehren: Wenn aktiviert, kehrt die Regel das Ergebnis um. Maximale Version. (Optional): Falls vorhanden, ist dies die maximale Version des Produkts. Falls nicht vorhanden, gibt es keinen Filter Maximale Version. Minimale Version. (Optional): Falls vorhanden, ist dies die minimale Version des Produkts. Falls nicht vorhanden, gibt es keinen Filter Minimale Version. Sprache (Optional): Falls vorhanden, wird auf die Sprache gefiltert werden. Falls nicht vorhanden, werden alle Sprachen als gültig betrachtet.
fr: Vérifie qu'un patch spécifique est installé pour le produit spécifié. Code MSP (Obligatoire) : Code du patch MSP dont le status doit être vérifié. Format 12345678-1234-1234-1234-123456789012 Code Produit (Obligatoire) : Code MSI du produit qui doit être vérifié. Format 12345678-1234-1234-1234-123456789012 Inverser la règle : Si cochée, évalue la règle puis inverse la résultat. Version Max (Optionnel) : Si présente, spécifie la version Max du produit. Version Min (Optionnel) : Si présente, spécifie la version Min du produit. Language (Optionnel) : Si présente, spécifie le language sur lequel filtrer.
ru: Проверяет, установлен ли указанный патч для продукта. Код пути (Обязательно): Код патча MSI, который подлежит проверке. Формат 12345678-1234-1234-1234-123456789012 Код Msi (Обязательно): Код продукта MSI для проверки. Формат 12345678-1234-1234-1234-123456789012 Реверсивное правило: Если установлено, правило будет возвращать обратное значение. Максимальная версия. (Дополнительно): Если указано, то принимается максимальной версией продукта. Если не указано, то фильтр по максимальной версии не применяется. Минимальная версия. (Дополнительно): Если указано, то принимается минимальной версией продукта. Если не указано, то фильтр по минимальной версии не применяется. Язык (Дополнительно): Если указано, то осуществляется фильтр по языку. Если не указано, то все языки считаются подходящими.

# SendRebootNow
source: Reboot remote computer(s)...
de: Remote Computer neu starten...
fr: Redémarrer le/les ordinateur(s) distant(s)...
ru: Перезагрузить удаленный(е) компьютер(ы)

# DescriptionFileCreatedPrependRegSz
source: Same as FileCreated, but the Client will prepend the specified REG_SZ value from the registry instead of a CSIDL. Hkey_Local_Machine (Required) : Hive of the registry where is the name of the directory. Value (Required) : Name of the registry key where is the name of the directory. File Name (Required) : Name of the file to search for (260 char. max.). Creation Date (Required) : Creation date of the file.
de: Identisch zu Dateierstellungsdatum, aber der Update Client wird den angegebenen Reg_SZ Wert aus der Registry anhängen, anstelle die CSIDL zu verwenden. HKEY_Local_Machine (erforderlich): Zweig der Registry in dem sich der Name des Verzeichnisses befindet Wert (erforderlich): Name des Registrywertes der den Verzeichnisnamen enthält. Dateiname (Erforderlich): Zu suchender Dateiname (260 Zeichen maximal). "Erstellungsdatum (Erforderlich): Erstellungsdatum der Datei."
fr: Comme 'Date de Création du Fichier' mais le nom du fichier est préfixé par la valeur du clé de registre. Hkey_Local_Machine (Obligatoire) : Ruche du registre où se trouve la valeur qui contient le préfixe. Valeur (Obligatoire) : Valeur du registre où se trouve le préfixe.. Répertoire (Obligatoire) : Nom du fichier (Max 260 caractères). Date de création (Obligatoire) : Date de création du fichier.
ru: То же что и FileCreated, но клиент добавит указанное значение REG_SZ из реестра вместо CSIDL. Hkey_Local_Machine (Обязательно) : Куст реестра, в котором содержится название папки. Значение (Обязательно) : Имя ключа реестра, в котором содержится название папки. Имя файла (Обязательно) : Полный путь к файлу (максимум 260 символов.). Дата создания (Обязательно) : Дата создания файла.

# DescriptionFileModified
source: Compares the specified file's modification date to the specified value. If Csidl is specified, the MSUS Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - Known Folders (Optional) : A list of wellknown folders. - File Path (Required) : The path to the file. - Comparison (Required) : The comparison operator. - Modification Date (Required) : Date of modification.
de: Vergleicht das Dateiänderungsdatum mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Bekannte Ordner (optional): Eine Liste von bekannten Ordnern. Pfad zur Datei (Erforderlich): Pfad zur Datei. Vergleichsoperator (Erforderlich): Vergleichsoperator Änderungsdatum (Optional): Änderungsdatum.
fr: Compare la date de modification du fichier spécifié à la valeur fournie. Si 'Répertoire prédéfini' est spécifié, le client appel Win32 SHGetFolderPath afin de retrouver le nom du répertoire et l'ajouter au début du 'Chemin' fourni. - Répertoire Prédéfini (Optionnel) : Permet de désigner un répertoire par ca variable d'environnement. - Chemin (Obligatoire) : Chemin vers le fichier. - Comparaison (Obligatoire) : L'opérateur de comparaison. - Date de modification (Obligatoire) : Date de modification.
ru: Сравнивает конкретную дату создания файла с заданным значением. Если указан идентификатор CSIDL, клиент MSUS Client вызовет функцию Win32 SHGetFolderPath для получения CSIDL и добавит его к пути нахождения файла. - Известная папка (Дополнительно): A list of wellknown folders. - Путь к файлу (Обязательно): Полный путь к файлу (максимум 260 символов.). - Сравнение(Обязательно): Оператор сравнения. - Дата изменения (Обязательно): Дата изменения.

# DescriptionFileSize
source: Compares the specified file's size to the specified value. If Csidl is specified, the MSUS Client will call Win32 SHGetFolderPath to retrieve the CSIDL and prepend it to Path to form the actual path to the file. - Known Folders (Optional) : A list of wellknown folders. - File Path (Required) : The path to the file. - Comparison (Required) : The comparison operator. - File Size (Required) : The size of the file, in bytes, for the comparison.
de: Vergleicht die Dateigröße mit dem angegebenen Wert. Wenn eine CSIDL angegeben wurde, wird der Update Client die Win32 SHGetFolderPath-Funktion aufrufen um den korrekten Pfad zur Datei zu bilden. Bekannte Ordner (optional): Eine Liste von bekannten Ordnern. Pfad zur Datei (Erforderlich): Pfad zur Datei. Pfad zur Datei (Erforderlich): Pfad zur Datei. "Dateigröße (Erforderlich): Dateigröße erforderlich in Bytes für den Vergleichsoperator."
fr: Compare la taille du fichier spécifié à la valeur fournie. Si 'Répertoire prédéfini' est spécifié, le client appel Win32 SHGetFolderPath afin de retrouver le nom du répertoire et l'ajouter au début du 'Chemin' fourni. - Répertoire Prédéfini (Optionnel) : Permet de désigner un répertoire par ca variable d'environnement. - Chemin (Obligatoire) : Chemin vers le fichier. - Comparaison (Obligatoire) : L'opérateur de comparaison. - Taille du Fichier (Obligatoire) : Taille du fichier, en octets, pour la comparaison.
ru: Сравнивает размер файла с заданным значением. Если указан идентификатор CSIDL, клиент MSUS Client вызовет функцию Win32 SHGetFolderPath для получения CSIDL и добавит его к пути нахождения файла. - Известная папка (Дополнительно): Список известных папок. - Путь к файлу (Обязательно): Полный путь к файлу (максимум 260 символов.). - Сравнение(Обязательно): Оператор сравнения. - Размер файла (Обязательно): Размер файла в байтах для сравнения.

source: MetaGroup
de: MetaGruppe
fr: MetaGroupe
ru: Метагруппа

source: Computer Group Name
de: Computergruppe
fr: Nom du Groupe d'Ordinateur
ru: Имя группы компьютеров.

source: &Create MetaGroup
de: Metagroup erstellen
fr: &Créer un MetaGroupe
ru: &Создать Метагруппу

source: &Edit MetaGroup
de: &Meta Gruppe bearbeiten
fr: &Modifier un MetaGroupe
ru: &Редактировать Метагруппу

source: MetaGroup Name
de: Name der MetaGruppe
fr: Nom du MetaGroupe
ru: Название Метагруппы

source: Delete this MetaGroup
de: Metagruppe löschen
fr: Supprimer ce MetaGroupe
ru: Удалить эту Метагруппу

source: Manage MetaGroups...
de: MetaGruppen verwalten…
fr: Gérer les MetaGroupes...
ru: Управление Метагруппами…

source: Manage This MetaGroup...
de: Diese MetaGruppe verwalten…
fr: Gérer ce MetaGroupe...
ru: Управление этой Метагруппой…

# CreateUpdate
source: Create an update...
de: Update erstellen…
fr: Créer une mise à jour...
ru: Создание и обновление…

source: Quick Approval
de: Schnelles Genehmigen
fr: Approbation Rapide
ru: Быстрое разрешение

# CredentialFailed
source: Failed to connect with provided crendentials. Do you want to continue to use these credentials (may lock the account) ?
de: Mit den angegebenen Anmeldeinformationenist keine erfolgreiche Verbindung möglich. Benutzername und Passwort weiterhinverwenden? (Der Account könnte nach mehrfachenFehlversuchen gesperrt werden.)
fr: Echec de connexion avec les informations de compte fournis. Voulez-vous continuer d'utiliser ces informations de connexion (risque de verrouillage du compte) ?
ru: Произошла ошибка при попытке подключения с предоставленными учетными данными. Использовать из в дальнейшем (это может привети к блокировке учетной записи) ?

source: Failed to Connect.
de: Verbindung fehlgeschlagen.
fr: Echec de connexion.
ru: невозможно подключиться.

source: Clean UpdateServicesPackages Folder...
de: UpdateServicesPackages Verzeichnis bereinigen
fr: Nettoyer le répertoire UpdateServicesPackages...
ru: Очистка папки UpdateServicesPackages...

source: Installed Or Not Applicable
de: Installiert oder nicht verfübar
fr: Installée ou non Applicable
ru: Установлено, но неприменимо

source: Invalid
de: Gültig
fr: Invalide
ru: Неверно

# NearExpiration
source: Expire in less than 30 days
de: Verfällt in weniger als 30 Tagen
fr: Expire dans moins de 30 jours
ru: Истекает менее чем через 30 дней.

source: Not yet valid
de: Noch nicht gültig
fr: Pas encore valide
ru: Пока не проверено

source: Valid
de: Gültig
fr: Valide
ru: Правильно

# CertificateAbstent
source: You do not have a certificate. You will not be able to publish updates.
de: Es liegt kein Zertifikat vor. Es können keine Updates erstellt werden
fr: Vous n'avez pas de certificat. Vous ne pourrez pas publier de mises à jour.
ru: У Вас нет сертификата. Вы не сможете опубликовывать обновления.

# CertificateExpired
source: The certificate has expired. You will not be able to publish updates.
de: Das Zertifikat ist abgelaufen. Es können keine Updates erstellt werden
fr: Le certificat a expiré. Vous ne pourrez pas publier de mises à jour.
ru: Сертификат просрочен. Вы не сможете опубликовывать обновления.

# CertificateInvalid
source: The certificate is invalid. You will not be able to publish updates.
de: Das Zertifikat ist ungültig. Es können keine Updates erstellt werden
fr: Le certificat n'est pas valide. Vous ne pourrez pas publier de mises à jour.
ru: Сертификат поврежден. Вы не сможете опубликовывать обновления.

# CertificateNearExpiration
source: Your certificate will expire in less than 30 days.
de: Das Zertifikat läuft innerhalb der nächsten 30 Tage ab.
fr: Votre certificat expire dans moins de 30 jours.
ru: Срок действия Вашего сертификата истекает менее чем через 30 дней.

# CertificateNotYetValid
source: The certificate is not yet valid. You will not be able to publish updates.
de: Das Zertifikat ist noch nicht gültig. Es können keine Updates erstellt werden
fr: Le certificat n'est pas encore valide. Vous ne pourrez pas publier de mises à jour.
ru: Сертификат пока не проверен. Вы не сможете опубликовывать обновления.

source: Computers found.
de: Gefundene Computer
fr: Odinateurs trouvés.
ru: Компьютеры найдены.

# SearchingComputerInAD
source: Searching Computers in AD
de: Computerobjekte im Active Directory suchen.
fr: Recherche des Ordinateurs dans AD.
ru: Поиск компьютеров в AD

source: Searching Computers In WSUS
de: Computerobjekte im WSUS suchen.
fr: Recherche des Ordinateurs dans WSUS.
ru: Поиск компьютеров в WSUS

source: Reset
de: Zurücksetzen
fr: Réinitialisé.
ru: Сброс

source: Unreachable
de: Nicht zu finden
fr: Injoignable.
ru: Недоступно

source: Not Required
de: Nicht benötigt
fr: Non Requis.
ru: Не требуется

source: Approval
de: Genehmigung
fr: Approbation
ru: Разрешение

source: Get Wsus Client ID
de: SUSClientID anzeigen
fr: Lire l'ID du Client Wsus
ru: Получить идентификатор клиента WSUS

# QueryServiceStatus
source: Query Windows Update Service Status
de: Status WSUS abfragen
fr: Lire le status du Service Windows Update
ru: Запрос статуса службы обновления Windows

source: Reset Wsus Client ID
de: SUSClientID erneuern
fr: Réinitialiser l'ID du Client Wsus
ru: Сбросить идентификатор клиента WSUS

# RestartService
source: Restart Windows Update Service
de: Windows Update Service neu starten
fr: Redémarrer le Serivce Windows Update
ru: Перезапуск службы обновления Windows
