[
  {
    "Id": "1080179",
    "ThreadId": "453304",
    "Html": "Hi Team,\r<br />\n<br />\nCan we associate SCUP 2011 ( System Center Update Publisher ) with WPP ? We did a test, but unable to deploy updates from Adobe Reader and Flash player.\r<br />\n<br />\nOur set-up is that, SCUP will download updates and we will approve it in WPP. Adobe updates are visible to WPP, we are able to approved it but updates are not being installed to our client machines.\r<br />\n<br />\nWhen we revised updates, we are getting error :\r<br />\n<br />\nVerification of file signature failed for file: \\WSUSServer\\UpdateServicesPackages\\07151137-3b83-4064-8fc2-7bf983d6b08b\\9634ef01-54b0-46d3-b8d3-c5f3def701ed_1.cab.\r<br />\n<br />\nThe certificate was generated by WPP and imported to Trusted Root Certification Authorities and  Trusted Publisher.\r<br />\n<br />\nPlease advise if this is possible. Thanks!\r<br />\n<br />\nOur WSUS server was able to push WINDOWS update successfully.<br />\n",
    "PostedDate": "2013-08-13T10:32:54.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1080230",
    "ThreadId": "453304",
    "Html": "Hi cjp_21,\r<br />\n<br />\nLet's see if I have well understood your situation ?\r<br />\n<br />\nYou have Scup installed, and you have published, with SCUP, a package for Adobe Reader. Scup had his own Code-Signing certificate, so it has signed the package.\r<br />\nThen you have installed WPP, generate a new Code-Signing certificate (Does WPP  ask you to do that ???). And now you try to revise the package that was signed with the first certificate while using the second certificate ?\r<br />\nI'm right ?<br />\n",
    "PostedDate": "2013-08-13T12:51:41.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1080256",
    "ThreadId": "453304",
    "Html": "Hi DCourtel,\r<br />\n<br />\nYes you're correct. We have SCUP installed to download non-MS updates. As of now, we are using LUP to approved those updates in WINDOWS Server 2008 but since we are planning to upgrade to WINDOWS Server 2012, we are now trying WPP as LUP does not work in WINDOWS SERVER 2012. we are still in testing stage. We have WINDOWS Server 2012 with WSUS, SCUP and WPP installed.\r<br />\n<br />\nWe only used 1 certificate. We tried certificate generated from WPP then imported it to SCUP and vise versa, we received same error, we cannot generate 2 certificates in WSUSServer\\WSUS certificate folder since it will only overwrite the certificate in it.\r<br />\n<br />\nWe only tried to revise the package to check its content since it wasn't pushed to our clients.\r<br />\n<br />\nWe also tried to expire the package but we received the same error.\r<br />\n<br />\nThanks!<br />\n",
    "PostedDate": "2013-08-13T14:03:06.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1080339",
    "ThreadId": "453304",
    "Html": "Ok,\r<br />\neach time you change certificat, you need to resign already published packages.\r<br />\nRight-click on a package and choose resign. Ensure that the certificate that is currently in the 'Wsus' store in the certificat magazin is the one that is used by clients computer.<br />\n",
    "PostedDate": "2013-08-13T21:50:06.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1080680",
    "ThreadId": "453304",
    "Html": "Hi,\r<br />\n<br />\nWe already resigned the previous packages and downloaded new package using the present certificate in WSUS folder, also imported in Trusted Root Certification Authorities and Trusted Publisher on our client machines but without success. \r<br />\n<br />\nAnd also AcceptTrustedPublisherCerts = 1 for client machine,\r<br />\n<br />\nWe tried your instruction in creating updates ( Adobe Flash Player) and it was successfully published on our client machines.\r<br />\n<br />\nDo you think, SCUP cannot associate with WPP, for now? Have you heard with anyone who successfully set-up WSUS, SCUP and WPP ?\r<br />\n<br />\nThe good thing with SCUP is that you don't need to manually provide the information for the updates, but if this will not work, we will use WPP only. Thanks!<br />\n",
    "PostedDate": "2013-08-14T12:11:33.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1080820",
    "ThreadId": "453304",
    "Html": "Honestly, I never used SCUP. But in my opinion, SCUP works like WPP. These two Tools use Wsus API and the Wsus certificate. So they should works together with Wsus.<br />\n<blockquote>\nThe good thing with SCUP is that you don't need to manually provide the information for the updates<br />\n</blockquote>\nYou mean that you import catalogs from third-party vendors ?\r<br />\nIf yes, I'm nearly ready to add this feature to WPP. I need to make some test in real world, so if you can give me links where I can download catalogs (I'm already aware of Dell, HP, and Adobe).\r<br />\n<br />\nMay be that other WPP users have successfully set SCUP, WPP and Wsus...<br />\n",
    "PostedDate": "2013-08-14T22:59:58.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2013-10-05T05:25:02.8-07:00"
  },
  {
    "Id": "1080952",
    "ThreadId": "453304",
    "Html": "SCUP has catalogs for Adobe, DELL, Fujitsu and HP.<br />\n\r<br />\nThis is what I found in SCUP:\r<br />\n<br />\nadobe Flash        : <a href=\"http://fpdownload.adobe.com/get/flashplayer/current/licensing/win/AdobeFlashPlayerCatalog_SCUP.cab_\" rel=\"nofollow\">http://fpdownload.adobe.com/get/flashplayer/current/licensing/win/AdobeFlashPlayerCatalog_SCUP.cab_</a>\r<br />\nAdobe Reader    : <a href=\"http://armmf.adobe.com/arm-manifests/win/SCUP/Reader10_Catalog.cab\" rel=\"nofollow\">http://armmf.adobe.com/arm-manifests/win/SCUP/Reader10_Catalog.cab</a>\r<br />\nAdobe Acrobat   :  <a href=\"http://armmf.adobe.com/arm-manifests/win/SCUP/Acrobat10_Catalog.cab\" rel=\"nofollow\">http://armmf.adobe.com/arm-manifests/win/SCUP/Acrobat10_Catalog.cab</a>\r<br />\nDELL Client          : ftp://ftp.dell.com/catalog/DellSDPCatalogPC.cab\r<br />\nDELL servers        : ftp://ftp.dell.com/catalog/DellSDPCatalog.cab\r<br />\nFujitsu                 :  <a href=\"https://support.ts.fujitsu.com/GFSMS/globalflash/FJSVUMCatalogForSCCM.cab\" rel=\"nofollow\">https://support.ts.fujitsu.com/GFSMS/globalflash/FJSVUMCatalogForSCCM.cab</a>\r<br />\nHP client             : ftp://ftp.hp.com/pub/softlib/software/sms_catalog/HpCatalogForSms.latest.cab\r<br />\nHP server            : ftp://ftp.hp.com/pub/softlib/software10/COL25555/sy-65640-1/ProLiant.cab\r<br />\nHP Proliant         : ftp://ftp.hp.com/pub/softlib/puc/hppuc.cab\r<br />\n<br />\nOnce we publish the updates from SCUP, it will be visible to WPP.\r<br />\n<br />\nWith SCUP, we don't need to create the updates manually, Product Name, Description, Support and Info URL, Security Bulletin ID and KB Article are already fill out.\r<br />\nWe will check again, and maybe have a fresh installation on our servers since we did several changes on the server. \r<br />\n<br />\nThanks!<br />\n",
    "PostedDate": "2013-08-15T07:17:47.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1081248",
    "ThreadId": "453304",
    "Html": "Thanks for these links.<br />\n",
    "PostedDate": "2013-08-16T00:26:34.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]