[
  {
    "Id": "1214972",
    "ThreadId": "535569",
    "Html": "Hi there, \r<br />\n<br />\n I have the following WSUS Architecture: \r<br />\n WSUS-Main -&gt; Contains all the CAB files (works together with WSUS-SQL). \r<br />\n WSUS-SQL -&gt; The database needed by WSUS-Main. \r<br />\n WSUS-Servant -&gt; Gets patches from WSUS-Main/SQL so that it can deploy patches to Client Workstation \r<br />\n Client Workstation -&gt; Gets patches from WSUS-Servant because of security reasons. \r<br />\n<br />\nI had installed the WPP into WSUS-Main and WSUS-Servant and had used the WPP in WSUS-Main to generate the certificate. Then when I used that certificate on WSUS-Servant, it displayed a &quot;You don't have any certificat,. You will not be able to publish updates&quot;.\r<br />\n<br />\nIs there something that I am missing? I've already set all computers to install Locally Publish Updates, according to the Installation Guide.pdf<br />\n",
    "PostedDate": "2014-02-25T22:15:44.98-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1215040",
    "ThreadId": "535569",
    "Html": "Hi, I will assume that your Wsus-Servant is a Wsus Downstream server and Wsus-Main is the Upstream server.\r<br />\n<br />\nYour workstations pulls updates from the downstream server, so the downstream server needs to get updates from the upstream server, so the downstream server needs to trust the upstream server.\r<br />\n<br />\nYou have to add the code signing certificate into the 'Trusted Publisher' store of the downstream server. If the certificate is an self-signed cert then the same certificate must be add to the &quot;Trusted Authority&quot; on the downstream server. Otherwise you have to add the certificate of the root authority that have issued out the code signing certificate, into the &quot;Trusted Authority&quot; . This will allow the downstream server to pull locally published updates from the upstream server.\r<br />\n<br />\nIf you want to locally publish onto the downstream server directly, you have to create a self-signed code signing certificate from the downstream server (don't forget to spread this certificate onto clients workstations). \r<br />\n<br />\nI do recommend to publish only on the upstream server, because it's much more complicated to manage certificate otherwise.<br />\n",
    "PostedDate": "2014-02-26T02:31:39.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1217558",
    "ThreadId": "535569",
    "Html": "Hi there,<br />\n<br />\nI had used the WPP-Servant to create this self-signed certificate by clicking on &quot;Generate the Cert&quot; button and placed it into &quot;Trusted Root Certification Authorities&quot; and &quot;Trusted Publishers&quot; certificates folder of WPP-Servant. However, after I restarted WPP-Servant and click on the &quot;Connect to Server&quot; button, it displays an error message, &quot;The certificate is invalid. You will not be able to publish updates&quot;. Is there some problems with the WPP's generating of certificate? Presently, I am using the latest version of WPP, Release v1.3.1401.04.<br />\n<br />\nAnyway, the reason I am adopting this WSUS architecture is due to security reasons as we do not want our client workstations to have any access to WSUS-Main and WSUS-SQL. Hence, I need to deploy this updates from WSUS-Servant.<br />\n<br />\n<strong>Example of our WSUS Architecture:</strong><br />\nWSUS-Main -&gt; IP Address: AA.XX.XX.XX<br />\nWSUS-SQL -&gt; IP Address: AA.XX.XX.XX<br />\nWSUS-Servant -&gt; IP Addresses: AA.XX.XX.XX and BB.XX.XX.XX<br />\nClient Workstations -&gt; IP Address: BB.XX.XX.XX<br />\n",
    "PostedDate": "2014-03-02T22:18:49.34-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1219037",
    "ThreadId": "535569",
    "Html": "What is the version of Wsus ?<br />\n",
    "PostedDate": "2014-03-04T07:33:06.157-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1221675",
    "ThreadId": "535569",
    "Html": "3.0 SP2<br />\n",
    "PostedDate": "2014-03-11T19:21:02.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1222891",
    "ThreadId": "535569",
    "Html": "If you have used the function to generate a self-signed certificate with a Wsus 3.0SP2, then the certificate has been generated by the Wsus server itself.\r<br />\nYou can try these options :<br />\n<ul>\n<li>Delete all Wsus-Selfsigned certificate in the &quot;Wsus&quot; store, &quot;Trusted  Root Certification Authorities&quot; and &quot;Trusted Publishers&quot; store, re-generate a sefl-signed certificate.\r<br />\nor</li>\n<li>In WPP use this option &quot;Ignore Code-Signing Certificate validation errors&quot; 'in Tools-&gt;Settings-&gt;Server Tab)</li>\n</ul>\n",
    "PostedDate": "2014-03-14T12:33:41.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1223755",
    "ThreadId": "535569",
    "Html": "Hi there, the WPP-Servant still displays an error message, &quot;The certificate is invalid. You will not be able to publish updates&quot;, despite re-generating the self-signed certificate and using the option &quot;Ignore Code-Signing Certificate validation errors&quot;. I was wondering whether we are supposed to generate this certificate from the upstream server and deployed to the rest of the servers, including the downstream server..\r<br />\n<br />\nAnyway, I was trying only on one machine, WSUS-Main, to test whether I can deploy updates to itself. As I run &quot;wuauclt /detectnow&quot; for the second time, the WSUS-Main could not detect any updates, even though the WPP console displays &quot;Not Installed&quot; on WSUS-Main. And when I right-click on WSUS-Main to install the update, it displays an error message, &quot;Fail to copy&quot;. I've already set WSUS-Main to install Locally Publish Updates, according to the Installation Guide.pdf and checked that Windows Firewall service is switched off.<br />\n",
    "PostedDate": "2014-03-17T19:19:39.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1225026",
    "ThreadId": "535569",
    "Html": "Hi,<br />\n<blockquote>\nWPP-Servant still displays an error message, &quot;The certificate is invalid. You will not be able to publish updates&quot;, despite [...] using the option &quot;Ignore Code-Signing Certificate validation errors&quot;. <br />\n</blockquote>\nI really don't know how you can do that ! This error message is display only when the certificate is invalid <strong>AND</strong> the option &quot;Ignore Code-Signing Certificate validation errors&quot; is <strong>NOT</strong> active.<br />\n<blockquote>\nAs I run &quot;wuauclt /detectnow&quot; for the second time, the WSUS-Main could not detect any updates<br />\n</blockquote>\nWhich updates do you want your Wsus detect if you don't have publish any update ?!?!?<br />\n",
    "PostedDate": "2014-03-20T15:10:23.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2014-05-08T02:49:27.34-07:00"
  },
  {
    "Id": "1225068",
    "ThreadId": "535569",
    "Html": "Hi,\r<br />\n<br />\nI am trying to deploy the update, Adobe Reader 9.3.3, AdbeRdr 933_en_US.exe. Despite the status has been detected as &quot;Not Installed&quot; and the .cab was accessible in my WPP console, I still could not detect any updates for me to download and install. Anyway, I have tried self-generating the certificate multiple times but I was again still unable to detect any updates for me to download and install. Any advice on this issue?<br />\n",
    "PostedDate": "2014-03-20T19:02:19.797-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]