[
  {
    "Id": "1292238",
    "ThreadId": "561815",
    "Html": "I have had WPP up and running successfully with no issues for some time now. Unfortunately, I accidentally clicked the &quot;Generate the certificate&quot; option today. It made a certificate and with no other options I saved it locally.\r<br />\n<br />\nWill this have any impact at all on existing and future updates? I'm hoping I don't have to redeploy that certificate but I'm guessing that I do. If that's the case, could I suggest an enhancement request to confirm the generating of a certificate when one is already in place, just for stupid accidents like this :(<br />\n",
    "PostedDate": "2014-08-21T13:30:16.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1292554",
    "ThreadId": "561815",
    "Html": "If you have a backup of this server, you can try to get back the certificate. If no backup available : <br />\n<ul>\n<li>Already published updates will continue to work (until the lost certificate expire)</li>\n<li>Newly created updates will be signed with the new certificate, so you have to distribute the new cert.\r<br />\nAs you will have to distribute the new certificate, I think it's better to re-sign old updates. So that, you can forgot about the old certificate.</li>\n</ul>\n",
    "PostedDate": "2014-08-22T12:39:05.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2014-08-22T12:51:52.23-07:00"
  },
  {
    "Id": "1292558",
    "ThreadId": "561815",
    "Html": "This discussion has been copied to a work item. Click <a href=\"https://wsuspackagepublisher.codeplex.com/workitem/215\" rel=\"nofollow\">here</a> to go to the work item and continue the discussion.<br />\n",
    "PostedDate": "2014-08-22T12:41:11.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1292562",
    "ThreadId": "561815",
    "Html": "I did have a copy of the .cer that WPP generated, but I wasn't able to import it into WPP (not a .pfx), and when I import into the wsus server, WPP said no certificate existed. \r<br />\n<br />\nIn any case, no problem! I'll redistribute the new cert and work on re-signing the old updates as suggested. Thanks!<br />\n",
    "PostedDate": "2014-08-22T12:51:49.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]