[
  {
    "Id": "1353183",
    "ThreadId": "581137",
    "Html": "Has anyone been able to publish Quicktime updates via WPP?\r<br />\n<br />\nAdmittedly I am new to WPP but I have been able to publish Adobe Reader/Flash player and Java 8.31 via WPP without issue using the guides on this site. \r<br />\n<br />\nI am at my wits end with Quicktime. If I publish the .exe file, Quicktime tries to run with user interaction (click next, etc.). \r<br />\n<br />\nI created a custom msi file with Orca and creating a mst transform file following the guide below (<a href=\"http://www.itninja.com/question/quicktime-player-7-7-2-fail-during-gpo-msi-deployment\" rel=\"nofollow\">found here</a>). I can get the custom quicktime.msi to install, but quicktime requires the AppleSupportTools.msi to be installed first. Using the guide below, I can deploy my custom Quicktime installers from a batch file and via PowerShell.\r<br />\n<br />\nAny guidance provided would be most appreciated.<br />\n<pre><code>Here is the process I follow to prepare quicktime for deployment. It can be a real trick if you do not prepare it just right.  \n\nPrepare the MSI files and MSI transforms for copy to software store\n\n    Download latest Quicktime from  http://www.apple.com/quicktime/\n    Use 7-zip or WinRAR to extract QuickTimeInstaller.exe.\n    Download and install Orca to edit the extracted QuickTime.msi. You can get orca itself from Microsoft's Windows Installer SDK or get the tool by itself from Softpedia.\n    Use Orca or Instedit to open QuickTime.msi. Locate the Summary information. This is located under view -&gt; summary information in Orca or Tables -&gt; Summary Info... in Instedit. Locate the Languages: box and remove all languages except 1033.\n    Save the transformed MSI as something meaningful or overwrite the original QuickTime.msi.\n    Create a new Transform (Transform -&gt; New Transform)\n    Make the following modifications to the Transform tables:\n        LaunchCondition -&gt; NOT BNEWERPRODUCTISINSTALLED: Delete this line, if you don't, quicktime will not install, you'll get an error in the event viewer, and itunes will go ahead and install but then tell you it can't launch because quicktime is not installed.\n        Property -&gt; SCHEDULE_ASUW: Set this to 0 to avoid iTunes trying to update itself. This is one of the main reasons for me rolling this out with group policy.\n        Registry -&gt; Find the item that has QTTask.exe as it's component and drop that line. This keeps qttask.exe from running in the background, which you don't need.\n        Shortcut: Drop Desktop shortcut, Uninstall shortcut, and Readme lines\n    Generate a new transform (Transform menu) and save it as something meaningful. I've been using the format ProgramName_&lt;version&gt;.mst (quicktime_7_7_2.mst).\n    Use Orca or Instedit to open AppleApplicationSupport.msi. Locate the Summary information. This is located under view -&gt; summary information in Orca or Tables -&gt; Summary Info... in Instedit. Locate the Languages: box and remove all languages except 1033.\n    Save the transformed MSI as something meaningful or overwrite the original AppleApplicationSupport.msi.\n\nThe command lines are as follows\nThe current command lines for the software are as follows. \n\nmsiexec /qn /i AppleApplicationSupport.msi /norestart \nmsiexec /qn /i QuickTime.msi /norestart TRANSFORMS=&quot;quicktime_7_7_2.mst&quot;\n\nMy process is Modified from this process http://www.beyondpictures.com/blog/tech/2009/03/deploy-itunes-with-group-policy.html \n \n \nI deploy via SCCM 2007 from a network share, but this should also work via group policy. SCCM installs using the system account without errors. </code></pre>\n\n",
    "PostedDate": "2015-02-16T13:29:15.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1353352",
    "ThreadId": "581137",
    "Html": "Try to get some informations on this EXE file. May be, there is some kind of switch you can use to perform a silent install (/s or /silent...)<br />\n",
    "PostedDate": "2015-02-17T03:20:45.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]