[
  {
    "Id": "1426547",
    "ThreadId": "638378",
    "Html": "Hi,\r<br />\nI update Adobe Flash player since a lot of time via LUP/ WPP, an since version 13 I use the Adobe Catalog. No problems in the last months.\r<br />\nNow, since last week I want to deploy V 17.0.0.188 NPAPI ( Firefox), and I do the same ....\r<br />\nopen catalog, mark the update, download and create the update, give it free to deployment....\r<br />\n<br />\nIn most scenarios, the update failed, because I deploy it together with Adobe Reader update and a lot of other Windows Updates ( Patch day ).\r<br />\nThis generate a lot of troubble:\r<br />\nNext day, clients install the Flash Update, and Windows Update tell me : yes, update successful. But If I check Adobe Flash, version number is old 17.0.0.169, and Windows clients will install the update again and again and again every day.\r<br />\nI checked the event manager, but cant find a error.\r<br />\n<br />\nI delete the update completly in WPP, and created again, but I cant achieve improvement.  Clients are without  or with old flash, but they dont want to install actual version, now, WPP Update Status was &quot;not availible&quot;. This was realy realy frustrating.\r<br />\n<br />\nIf I download and installed V 17.0.0.188 manuall on a test client from Adobe Website, Installation works correctly.\r<br />\n<br />\nSo, I download the flash player plugin as  .msi from Adobe, and create and deploy it with WPP on classic way without catalog import.\r<br />\nAnd this works, clients updated without problems.\r<br />\n<br />\nThere are no WPP / update  problems with other software in this time.\r<br />\nAffects all Clients - XP / W7 32bit  / W7 64bit\r<br />\n \r<br />\nI hope I can give a little help for other people with this troubble report.\r<br />\n<br />\nMARK FOR FUTURE: DO NOT DEPLOY ADOBE READER; FLASH; WINDOWS .NET AND WINDOWS SECURITIY UPDATES AT THE SAME TIME :-)\r<br />\n<br />\nREMEMBER: YOU CAN WITCH BETWEEN CATALOG AND NORMAL .MSI DEPLOYMENT WITHOUT PROBLEMS.<br />\n",
    "PostedDate": "2015-05-20T04:16:05.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2015-05-21T03:11:42.513-07:00"
  }
]