[
  {
    "Id": "1480459",
    "ThreadId": "656942",
    "Html": "Hallo Community!<br />\n<br />\nIch beschäftige mich seid kurzer Zeit mit dem WPP und muss ein Kompliment an die Entwickler aussprechen, sehr gute Arbeit. Ein paar Fragen bzw. Hilfestellung hätte ich dennoch.<br />\n<br />\n<strong>Fakten zu unserer Umgebung:</strong> <br />\nTerminalserver 2008R2 x64 mit installiertem Java und Adobe Reader in den o. g. Versionen<br />\nClients mit Windows 7 x64<br />\nWsus 6.3.9600.17477 auf Server 2012R2 SQL-Express 2012<br />\n<br />\n<strong>Meine WPP Servereinstellungen:</strong><br />\nNeues Update Veröffentlichen = Immer Wählen angehakt.<br />\nDer rest auf Standard gelassen. Der WPP läuft und mit dem CodeSigning Zertifikat ist auch alles in Ordnung, dieses gibt es ohnehin in unserer Umgebung und hat einiges vereinfacht.<br />\nEin Proxy ist eingetragen und funktioniert.<br />\n<br />\nUnklarheiten existieren bei Java und Adobe Reader, bei Java besteht das Problem der Ferninstallation (Client und Server), also das Kommando Dieses Update installieren wird mit einer Typischen Fehlermeldung 0x80070643 quittiert. Der Client ist so eingestellt das dieser beim Neustart oder Herunterfahren die Updates installieren soll, dies wird versucht aber auch mit obiger meldung quittiert. Die Server sind natürlich nicht auf Automatik eingestellt, dort muss Update Vorgang angestoßen werden, bevorzugt mache ich dies mit POSH_PAIG (Powershell GUI) selbige Meldung. Interessanterweise funktioniert es aber wenn ich als Admin auf einer dieser Maschinen angemeldet bin und den Vorgang manuell einleite, ohne Probleme!<br />\nTestsystem Win7 client mit Terminalserver 2008R2 ohne das ein RDP Benutzer angemeldet wäre, also die Benutzung des Java Clients während des Update-Vorganges auszuschließen ist.<br />\n<br />\n<strong>Hier würde mich interessieren wie ich eine Update Installation aus der Ferne über WPP oder POSH_PAIG hinbekomme? Windows Updates funktionieren weiterhin. Fehlermeldung: Ressource konnte nicht gefunden werden ReportingEvent.Client.181</strong><br />\nAls angemeldeter Admin kann ich das Update manuel anstoßen und es wird installiert!? <br />\n<br />\nJava wurde wie folgt eingebunden:<br />\nE:\\WPP-Content\\Java_JRE&gt;MSI ausgewählt von zweiter Systemplatte auf der auch mein WSUS-Content liegt.<br />\nKeine weiteren Dateien<br />\nAlle Beschriftungen und Beschreibungen vorgenommen und Folgende Schalter hinzugefügt:<br />\nINSTALL_SILENT=Enable AUTO_UPDATE=Disable WEB_ANALYTICS=Disable EULA=Disable REBOOT=Disable NOSTARTMENU=Enable WEB_JAVA=Enable WEB_JAVA_SECURITY_LEVEL=H SPONSORS=Disable REMOVEOLDERJRES=1<br />\n<ol>\n<li>Regel MSI Produkt Installiert &gt; MSI Product Code angegeben</li>\n<li>\nRegel MSI Produkt Installiert &gt; MSI Product Code angegeben &gt; Haken bei Regel Umkehren<br />\nDann veröffentlichen ohne Anzeige im WSUS<br />\nFreigeben auf bestimmte Gruppe (Vorher im WSUS angelegt und Testobjekte eingestellt)<br />\n</li>\n</ol>\nFür den Adobe Reader habe ich mir das Tool Acrobat Customation Wizard DC heruntergeladen und installiert. Soweit so gut, MSI reingeladen und alle Einstellungen vorgenommen die mir wichtig sind, bei meinem Test dann die ernüchterung, die EULA und ein Fenster für die Anmeldung mit Adobe ID mussten erst einmal bestätigt werden, obwohl EULA explizit angehakt war, diese also zu Akzeptieren. <br />\n<br />\nDas Zweite Fenster mit der Adobe ID welche man einfachm mit Fortfahren wegklickt, habe ich in dem Customation Tool nicht gefunden.<br />\nHat hier jemand erfahrung oder kennt den Punkt wo man dies einstellen kann? Auch die EULA bestätigung nervt?<br />\n<br />\nDen Adobe Reader DC habe ich mit den selben Regeleinstellungen wie bei Java erstellt. <strong>Einziger Unterschied ist bei den &quot;weiteren Dateien hinzufügen&quot;, dass dort die AcroRdrDCUpd1501720050.msp (durch das customation Tool erstellt) und die Data1.cab mitgegeben werden muss</strong><br />\nDie .msp gibt quasi meine Einstellungen mit, so habe ich dies zumindest verstanden.<br />\n<br />\nDer Adobe Reader wurde auf meinem Test Terminalserver installiert, leider weiß ich nicht ob der Befehl gegriffen hat oder Reboot des Servers dafür gesorgt hat, dies muss ich noch eruieren. Aber es immerhin auf anhieb geklappt :-).<br />\n<br />\nIch freue mich auf eure Erfahrungen und bedanke mich schon jetzt für eure Hilfe<br />\n<br />\nViele Grüße<br />\nMike_DUS<br />\n",
    "PostedDate": "2016-08-05T01:08:47.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1480764",
    "ThreadId": "656942",
    "Html": "Hallo,<br />\n<br />\nok, die ganze Beschreibung geht für mich etwas durcheinander aber ich fang einfach mal an, und zwar mit Adobe.<br />\nSo wie ich das sehe benutzt du die falschen Versionen, denn du arbeitest mit dem Continius Track. Für dein Umfeld wäre der Classic Track ( nach kostenloser Lizenznahme) wohl die bessere Wahl. Und dann sollte das auch mit der MSI funktionieren, den dort ist das explizit vorgesehen.<br />\n<br />\nDas mit der .msp verstehe ich nicht, das sieht nach einem Update aus, wolltest du das inkludieren? Jedenfalls lauten die angepassten ( transformten) .msi normalerweise auf .mst und tragen nicht den Synthax eines Adobeupdates.<br />\n<br />\nEventuell mal meine alte Anleitung querlesen:<br />\n<br />\n<a href=\"http://road-books.jimdo.com/2015/07/09/howto-adobe-acrobat-reader-dc-2015-classic-track-angepasstes-software-deployment-mit-wsus-package-publisher/\" rel=\"nofollow\">http://road-books.jimdo.com/2015/07/09/howto-adobe-acrobat-reader-dc-2015-classic-track-angepasstes-software-deployment-mit-wsus-package-publisher/</a><br />\n<br />\nSo, muss erst mal was arbeiten, zu JAVA finde ich nachher eventuell noch Zeit :-)<br />\n",
    "PostedDate": "2016-08-10T05:40:22.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1480772",
    "ThreadId": "656942",
    "Html": "Ok, JAVA:<br />\n<br />\nDie Fehlermeldung deutet wohl darauf hin das der Pfad zur Installationssoftware nicht erreicht werden kann, vermutlich wegen fehlender Rechte. Installer und Benutzer sind zwei verschiedene paar Schuhe , eventuell mal die Freigabe kontrollieren.<br />\nDas erklärt auch warum es funktioniert wenn ein Admin es anstößt :-)<br />\n<br />\nWas ich nicht verstehe ist warum das gemacht wird:<br />\nRegel MSI Produkt Installiert &gt; MSI Product Code angegeben<br />\nRegel MSI Produkt Installiert &gt; MSI Product Code angegeben &gt; Haken bei Regel Umkehren<br />\n<br />\nEs ist ein .msi. Nach meiner Erfahrung ist das völlig unnötig und stellt eine mögliche Fehlerquelle dar. Ich setze  -bei .msi wohlgemerkt, bei .exe ist das was anderes- NIE eine Regel dort. Und ich hatte noch nie Probleme. Der MSI Installer hat das alles schon intus so wie ich das sehe. <br />\n<br />\nAm Rande:<br />\nAllgemein bin ich ein Freund von gleichartigen Verfahrensabläufen. Wenn ich also .msi verteile, dann nutze ich bevorzugt die Anpassung per modifizierter .msi, und zwar bei jeder Software die dafür in Frage kommt, und nicht bei Adobe so und bei Java so und bei Libre Office wieder anders. Das macht das Leben irgendwie einfacher.<br />\n",
    "PostedDate": "2016-08-10T06:31:39.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1481144",
    "ThreadId": "656942",
    "Html": "Moin GMBU,\r<br />\n<br />\nADOBE:\r<br />\nDanke für deine Tipps. Tatsächlich bin ich nach der verlinkten Anleitung für den Adobe Reader vorgegangen und habe mich dort auch registriert für diese Lizenz.\r<br />\nIch muss zugeben diese Lizenz sehe ich nirgendwo, aber in der Mail war ein Downloadlink <a href=\"http://get.adobe.com/de/reader/enterprise/\" rel=\"nofollow\">http://get.adobe.com/de/reader/enterprise/</a> von dem ich das Installationspaket gesaugt habe und dieses mit dem Acrobat Customation Wizard DC bearbeitet habe, so wie in der Anleitung.\r<br />\n<br />\nJAVA:\r<br />\nIch vermute Du meinst den Ordner &quot;UpdateServicesPackage&quot; vom WPP dieser ist exakt gleich von den Berechtigungen her wie der &quot;WsusContent&quot; Ordner.\r<br />\nIch habe die Freigabeberechtigungen als auch die NTFS Berechtigungen verglichen. Bei Adobe funktioniert es, bei Java nicht.\r<br />\n<br />\nDie Regeln welche ich benutze sind in vielen der Anleitungen zu finden im Netz, ich werde aber mal alles neu erstellen für Java und Adobe ohne diese Regeln.\r<br />\nVermutlich sind diese Regeln einfach überholt und wie Du sagst nicht mehr Zeitgemäß, da die Installer alles notwendige mitbringen. Ich berichte sobald ich neue Erkenntnisse habe. \r<br />\n<br />\nAm Rande:\r<br />\nDas Thema Softwareverteilung und WPP ist für mich Brandneu, deshalb bitte ich um Nachsicht.<br />\n",
    "PostedDate": "2016-08-15T00:32:45.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1481424",
    "ThreadId": "656942",
    "Html": "GuMo zusammen,<br />\n<br />\nUpdate:<br />\nIch habe jetzt um voran zu kommen, beide Programme (alte versionen) erst einmal deinstalliert, bedeutet also meine Verteilung startet clean mit unten genannten Versionen!<br />\n<br />\nJava 8 Update 101 ohne Regeln erstellt und das.msi file mit Orca enthalten im SDK ( <a href=\"https://developer.microsoft.com/de-de/windows/downloads/windows-10-sdk\" rel=\"nofollow\">https://developer.microsoft.com/de-de/windows/downloads/windows-10-sdk</a>).<br />\nWenn man das SDk setup ausführt benötigt man im Auswahlmenü nur die MSI-Tools - Google weiß das.<br />\nIn Orca habe ich folgende Einstellungen in den genannten Tabellen vorgenommen:<br />\n<br />\nProperty<br />\nAUTOUPDATECHECK = 0<br />\nJAVAUPDATE = 0<br />\nALLUSERS = 2<br />\nRebootYesNo = No<br />\n<br />\nInstallExecuteSequence<br />\nSetSilentInstall = UILevel=3<br />\n<br />\nDamit benötige ich keine extra Schalter mehr in WPP welche offensichtlich fehleranfällig sind bzw. für Fehler sorgen. Durch die ganzen Recherchen ist eines ganz deutlich klar geworden, es gibt tausend Anleitungen und wiedersprüchliche informationen auch seitens der Java .msi Möglichkeiten. Das einzige was hilft ist eine Teststellung. Der Schlüssel zum Erfolg bei mir bezüglich der automatischen Installation bei einem Client war, so glaube ich, die Einstellung ALLUSERS=2 (Berechtigungskontext zur Installation). Im übrigen werden auch oft Schalter wie REMOVEOLDERJRE=1 genannt, dieser Schalter ist im aktuellen java.msi bereits inkludiert, hat bei mir aber noch nicht funktioniert, womit wir bei dem nächsten Problem sind, die Deintsallation eines alten Java clients.<br />\n<br />\nAdobe Acrobat Reader DC _Deutsch 15.17.20050 Hauptversion<br />\nÜber das Katalogabonnements (ReaderCatalog-DC) Adresse <a href=\"http://armmf.adobe.com/arm-manifests/win/SCUP\" rel=\"nofollow\">http://armmf.adobe.com/arm-manifests/win/SCUP</a> konne ich mir eine Aktualisierung auf 15.17.20053<br />\nrunterladen und direkt importieren. Natürlich habe dieses Update (wird auch so im WPP geführt ung ggf. Automatisch auf die Gruppe ausgerollt - Einstellungen Prüfen im WPP) genehmigt und auf meine Testgruppe ausgerollt - Erfolgreich :-)<br />\n<br />\n<strong>Ich hoffe ich konnte ein wenig Licht für andere geben und hoffe, dass noch jemand ein Tipp für das Deinstallationsproblem mit Java geben kann.</strong> <br />\n__Das Problem mit dieser Meldung &quot;Fehlermeldung: (Die Ressource konnte nicht gefunden werden.:) ReportingEvent.Client.181&quot; existiert immer noch scheint trotzdem funktioniert es? Beides mit Error Code 0 im WPP<br />\nIch würde hier jetzt ein Bug vermuten ...?!__<br />\n<br />\n<br />\nViele Grüße<br />\n",
    "PostedDate": "2016-08-18T00:02:07.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1482417",
    "ThreadId": "656942",
    "Html": "Vorab: <br />\nIch habe mal meine eigene Anleitung aktualisiert nachdem ich auch ein paar Tage probiert habe :-)<br />\n<a href=\"http://road-books.jimdo.com/2016/08/16/java-jre-softwareverteilung-f%C3%BCr-wpp/\" rel=\"nofollow\">http://road-books.jimdo.com/2016/08/16/java-jre-softwareverteilung-f%C3%BCr-wpp/</a><br />\n<br />\nEin paar weitere hoffentlich lesenswerte Erkenntnisse:<br />\n<a href=\"http://road-books.jimdo.com/2016/08/15/versuch-oracle-konforme-softwareverteilung-von-java-8-mit-wsus-packet-publisher-wpp/\" rel=\"nofollow\">http://road-books.jimdo.com/2016/08/15/versuch-oracle-konforme-softwareverteilung-von-java-8-mit-wsus-packet-publisher-wpp/</a><br />\n<br />\n<br />\n<em>...beide Programme (alte versionen) erst einmal deinstalliert, bedeutet also meine Verteilung startet clean mit unten genannten Versionen!</em><br />\n<br />\nimmer eine gute Idee<br />\n<br />\n<br />\n<em>In Orca habe ich folgende Einstellungen in den genannten Tabellen vorgenommen:<br />\n<br />\nProperty<br />\nAUTOUPDATECHECK = 0<br />\nJAVAUPDATE = 0<br />\nALLUSERS = 2<br />\nRebootYesNo = No</em><br />\n<br />\nDas mit dem AllUSERS=2 hab ich bisher nicht gesehen, aber ok....<br />\n<br />\n_InstallExecuteSequence<br />\nSetSilentInstall = UILevel=3<br />\n<br />\n.................es gibt tausend Anleitungen und wiedersprüchliche informationen auch seitens der Java .msi Möglichkeiten. Das einzige was hilft ist eine Teststellung._ <br />\n<br />\nDas kommt auch daher das Sun und Oracle da seit Java 6 immer wieder herumgedoktert haben, und Oracle mitlerweile 3 JRE Versionen parallel anbietet die unterschiedliche Verteilungsmechanismen und Möglichkeiten haben. zB gibt es 2 verschiedene .msi !<br />\n<br />\n<em>Der Schlüssel zum Erfolg bei mir bezüglich der automatischen Installation bei einem Client war, so glaube ich, die Einstellung ALLUSERS=2 (Berechtigungskontext zur Installation).</em> <br />\n<br />\ngeht auch ohne. Das sagt doch im wesentlichen: &quot;Installation für alle oder nur für angemeldeten User&quot;. Oder nicht?<br />\n<br />\n<em>Im übrigen werden auch oft Schalter wie REMOVEOLDERJRE=1 genannt, dieser Schalter ist im aktuellen java.msi bereits inkludiert, hat bei mir aber noch nicht funktioniert, womit wir bei dem nächsten Problem sind, die Deintsallation eines alten Java clients.</em><br />\n<br />\ndieser Schalter funktioniert auch nicht mit einer extrahierten JAVA - .msi. Gründe: Link 2<br />\n<br />\nMein persönliches (!) aktuelles Deinstallationsvorgehen steht im obigen Link. Es gibt auch andere Wege.<br />\n<br />\n_Adobe ..........unterladen und direkt importieren. Natürlich habe dieses Update (wird auch so im WPP geführt ung ggf. Automatisch auf die Gruppe ausgerollt - Einstellungen Prüfen im WPP) genehmigt und auf meine Testgruppe ausgerollt - Erfolgreich :-)<br />\n_<br />\nNa Bitte !<br />\n<br />\n<em>.............. und hoffe, dass noch jemand ein Tipp für das Deinstallationsproblem mit Java geben kann.</em><br />\n<br />\nsiehe oben Link 1<br />\n<br />\n___Das Problem mit dieser Meldung &quot;Fehlermeldung: (Die Ressource konnte nicht gefunden werden.:) ReportingEvent.Client.181&quot; existiert immer noch scheint trotzdem funktioniert es? Beides mit Error Code 0 im WPP<br />\nIch würde hier jetzt ein Bug vermuten ...?!___<br />\n<br />\nDa mag ich jetzt mal nicht orakeln. Oder doch, so von weiter Ferne und unverbindlich und ohne fundierte Basis. Falls es tatsächlich nur mit ALLUSERS=2 geht, und die Fehlermeldung aktuell noch besteht, und man betrachtet beides im Zusammenhang - dann sieht es immer noch so aus als ob es irgendwo Rechteprobleme gibt, schließlich kann er irgendeine Resource nicht ereichen und muss den Berechtigungskontext nachkorigieren.<br />\n",
    "PostedDate": "2016-08-30T05:12:49.963-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]