[
  {
    "Id": "1487019",
    "ThreadId": "659025",
    "Html": "Hallo,<br />\n<br />\nich habe eine Aufgabe im Windows Package Publisher (WPP), die für mich schwer lösbar ist und benötige dafür bitte Unterstützung. Grundlage ist ein Windows Server 2012 Standard mit installiertem WSUS und WPP, beide in aktueller Form. <br />\nIm WPP verteile ich u.a. Java-Updates, die ich bis vor einigen Wochen auch sauber wieder &quot;zur Deinstallation&quot; genehmigen konnte und das Paket wiederum zwei Wochen darauf löschen konnte. Die Java-Updates werden entsprechend versioniert im WPP unter einem Ordner Oracle Corporaction angzeigt. Veraltete, auf den Clients im Netzwerk bereits deinstallierte Java-Versionen hake ich im WPP als &quot;Ablehnen&quot; bzw. &quot;Läuft ab&quot; und lösche sie anschließend. Bisher verschwand dabei auch das veraltete Java-Update links im WPP, unter dem Ordner Oracle Corporaction. Nun geschieht dies nicht mehr. Das veraltete Java-Update links im WPP bleibt bestehen und dahinter wird eine Null in Klammern angezeigt (solange das Java-Update vorhanden, also nicht gelöscht war, wurde entsprechend eine Eins angezeigt was auch völlig in Ordnung ist). Ich habe testweise die alte Java-Version wieder installiert, überarbeitet und auch einmal in einen anderen Ordner als Oracle Corporaction geschoben und das Löschen durchgeführt. Leider zeigte sich das gleiche Ergebnis. <br />\n<br />\nAndere Updates, beispielhaft für Adobe-Produkte, lassen sich sauber löschen. Eine frisch aus dem Internet gelade und bereitgestellte WPP-Variante brachte ebenfalls keine Besserung. Bevor ich nun in absehbarer Zeit eine Leerliste dieser veralteten Java-Versionen generiere, bitte ich hier um Rat.<br />\n",
    "PostedDate": "2016-10-27T10:50:40.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1487202",
    "ThreadId": "659025",
    "Html": "Unterhalb von Oracle einfach einen Rechtsklick auf den Namen des Produktes &gt; Löschen auswählen. Ist Löschen nicht aktivierbar, einmal weiter oben im Baum anklicken und wieder zurück zu der Stelle die man löschen möchte.<br />\n",
    "PostedDate": "2016-11-01T06:24:09.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1487247",
    "ThreadId": "659025",
    "Html": "<strong>Support_FUE wrote:</strong><br />\n<blockquote>\nHallo,<br />\n<br />\n.......... verteile ich u.a. Java-Updates&lt;<br />\n</blockquote>\nin welcher Form<br />\n<blockquote>\n, die ich bis vor einigen Wochen auch sauber wieder &quot;zur Deinstallation&quot; genehmigen konnte und das Paket wiederum zwei Wochen darauf löschen konnte. <br />\n&lt;<br />\n</blockquote>\nDas ist aber schon mehr als ein paar Wochen her das dasmit den .msi einfach so funktionierte<br />\n<blockquote>\nDie Java-Updates werden entsprechend versioniert im WPP unter einem Ordner Oracle Corporaction angzeigt. Veraltete, auf den Clients im Netzwerk bereits &gt;deinstallierte Java-Versionen hake ich im WPP als &quot;Ablehnen&quot; bzw. &quot;Läuft ab&quot; und lösche sie anschließend. <br />\n</blockquote>\nok, ja. Nach dem Löschen Schritt sollten sie rechts im WPP verschwinden.<br />\n<blockquote>\nBisher verschwand dabei auch das veraltete Java-Update links im WPP, unter dem Ordner Oracle Corporaction.<br />\nNun geschieht dies nicht mehr. Das veraltete Java-Update links im WPP bleibt bestehen und dahinter wird eine Null in Klammern angezeigt (solange das &gt;Java-Update vorhanden, also nicht gelöscht war, wurde entsprechend eine Eins angezeigt was auch völlig in Ordnung ist).<br />\n</blockquote>\nMoment, nicht das hierein Missverständnis vorliegt. Links befindet sich die Baumansicht, da steht &quot; Oracle Corporation &quot;, sofern du nur ein Produkt , also die Java JRE verteilst, steht dann dahinter eine 1. Unterhalb davon steht das Produkt &quot;JAVA&quot; , dahinter steht die anzehl der JAVA Updates die aktuell im WPP angelegt sind, egal welchen Status und Genehmigung sie haben. Links stehen also KEINE Updates, nur die Struktur. Bei mir steht zB eine 6 hinter Java, da ich diverse Varianten  habe, x64 usw.  und mehrere Uninstall- Updates für JAVA. Im Prinzip ist es erst mal kein Fehler wenn da JAVA (0) steht, es heißt nur das in der gelisteten Gruppe derzeit kein Update angelegt ist. \r<br />\nMöglicherweise ist es auch ein Fragment, eine gespeicherte Regel oder ähnliches was verhindert das die nicht mehr benötigte Struktur ausgeblendet wird.<br />\nAber du hast recht, typischerweise verschwinden Strukturanzeigen links wenn kein Update ( rechts) dafür mehr exsistiert. Winfrieds Tipp klingt gut und sollte helfen. Wenn nicht sollte es funktional aber auch kein Problem sein, nur optisch.<br />\n<blockquote>\nIch habe testweise die alte Java-Version wieder installiert, überarbeitet und auch einmal in einen anderen Ordner als Oracle Corporaction geschoben und das &gt;Löschen durchgeführt. Leider zeigte sich das gleiche Ergebnis. <br />\n<br />\nAndere Updates, beispielhaft für Adobe-Produkte, lassen sich sauber löschen. Eine frisch aus dem Internet gelade und bereitgestellte WPP-Variante brachte &gt;ebenfalls keine Besserung. Bevor ich nun in absehbarer Zeit eine Leerliste dieser veralteten Java-Versionen generiere, bitte ich hier um Rat.<br />\n</blockquote>\n",
    "PostedDate": "2016-11-02T02:06:25.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]