[
  {
    "Id": "1489864",
    "ThreadId": "660135",
    "Html": "Following the official documentation and I am getting that error when trying to import my code signing certificate into WPP. The only difference from the the guide and my setup is I am generating the code signing cert on an intermiadate CA which the Root CA trusts.\r<br />\n<br />\nOur Root CA is powered down and at this point I have no idea where it's at. I imagine it was powered on long enough to generate whatever certs the previous admins here needed and powered off after.\r<br />\n<br />\nNot sure what else I am missing. I generated the cert, exported it, created a GPO and imported the cert. Applied the GPO to an OU where my WSUS server lives, ran gpupdate /force, logged off and logged back in. Confirmed via the Certificates MMC that the certs are in the trusted publishers store. Trying to import it to WPP gives me the error above. I've also tried removing the cert from the WSUS cert store and importing just through WPP but Im getting the same error.\r<br />\n<br />\nAnyone have any idea what I'm doing wrong? I'd rather not use a self signed cert.<br />\n",
    "PostedDate": "2016-12-14T11:28:41.937-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2016-12-15T08:18:25.993-08:00"
  },
  {
    "Id": "1489922",
    "ThreadId": "660135",
    "Html": "ignore this. I found the solution in a different post. Just checked the ignore certificate verification.... on the settings section.<br />\n",
    "PostedDate": "2016-12-15T08:18:57.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1489966",
    "ThreadId": "660135",
    "Html": "The question is why the validation has failed?! Is it possible to get debug log for this Action, Import a certificate?<br />\n",
    "PostedDate": "2016-12-16T08:37:15.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1490867",
    "ThreadId": "660135",
    "Html": "If I do so - ignore - I can't create any update with function.<br />\n",
    "PostedDate": "2017-01-09T13:18:54.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]