<div class="wikidoc"><b>17/05/2014</b> : <br />WPP is now available in Russian. Thanks to VSharmanov.<br /><br /><b>09/09/2013</b> : <br />Carlos Paniago and Paskysky have joined the team. They will help into the translation (Portugues and Spanish).<br /><br /><b>09/06/2013</b> : <i>Release V1.2.1306.09</i><br /><b>English</b> : WPP is now available in German language.<br /><b>Fran&#231;ais</b> : WPP est maintenant disponible en Allemand.<br /><br /><b>15/05/2013</b> : <i>Release V1.2.1305.15</i><br /><b>English</b> : Adding a new feature that allow you to launch remotely the installation of updates. The tool &#39;Delete Empty Product&#39; is now part of WPP.<br /><b>Fran&#231;ais</b> : Ajout d&#39;une nouvelle fonctionnalit&#233; qui permet de lancer &#224; distance l&#39;installation des mises &#224; jour. L&#39;outil &#39;Delete Empty Product&#39; est int&#233;gr&#233; dans WPP.<br /><br /><b>03/05/2013</b> : <i>Release V1.1.1305.03</i><br /><b>English</b> : Many bug fix and enhancements. Adding a tool to delete Products that haven&#39;t any udpates but still present in the Database.<br /><b>Fran&#231;ais</b> : Nombreuse corrections et nouvelles fonctionnalit&#233;s. Ajout&#233; un outil pour supprimer les &quot;Produits&quot; qui n&#39;ont plus de mises &#224; jour mais qui restent pr&#233;sent dans la base de donn&#233;es. <br /><br /><b>22/02/2013</b> : <i>Release V1.1.1302.22</i><br /><b>English</b> : Now compatible with WSUS 4.0 (on Server 2012).Added a new feature to find computers that are present in Active Directory and not in WSUS. Show WSUS Client ID for these computers. Ability to reset the WSUS Client ID remotely.<br /><b>Fran&#231;ais</b> : Compatible avec Wsus 4.0 (sur Serveur 2012). Ajout&#233; une nouvelle fonctionnalit&#233; pour trouver les ordinateurs qui sont pr&#233;sent dans Active Directory et pas dans Wsus. Montre les Wsus Client ID pour ces ordinateurs. Permet de r&#233;initialiser ce Wsus Client ID &#224; distance. <br /><br /><b>03/11/2012</b> : <i>Release V1.1.12.11.03</i><br /><b>English</b> : Adding two more rules. Adding tools (MSI Property reader and ScriptLauncher). Adding a report tab to view update status on all computer group (even on Downstream servers) in one view.<br /><b>Fran&#231;ais</b> : Ajout&#233; deux nouvelles r&#232;gles. Ajout&#233; deux outils (MSI Property reader et ScriptLauncher). Ajout&#233; un onglet &#39;Rapport&#39; pour visualiser le status des mises &#224; jour dans tous les groupes d&#39;ordinateur (m&#234;me les groupes des serveurs downstream) en une seul vue.<br /><br /><b>01/10/2012</b> : <i>Release V1.1</i><br /><b>English</b> : Publishing first stable release.<br /><b>Fran&#231;ais</b> : Publication de la premi&#232;re version stable.<br /><br /><b>18/09/2012</b> : <i>Beta Release</i><br /><b>English</b> : Ability to revise updates, and to approve it.<br /><b>Fran&#231;ais</b> : Possibilit&#233; de r&#233;viser les mises &#224; jour, et de les approuv&#233;es.<br /><br /><b>11/08/2012</b> : <i>Beta Release</i><br /><b>English</b> : It still missing some fonctionnality. The server name can be provide in the &#39;Option&#39; page. Ability to publish MSI, MSP and EXE.<br /><b>Fran&#231;ais</b> : Il manque encore quelques fonctionnalit&#233;s. Le nom du serveur peut &#234;tre indiqu&#233; dans la page des options. Publication de MSI, MSP et EXE. <br /><br /><b>03/06/2012</b> : <i>Alpha stage</i><br /><b>English</b> : Not all features are implemented. Server name is hard coding and there&#39;is no option for generating the signing certificate. Only MSI files are supported. No reports available.<br /><b>Fran&#231;ais</b> : Toutes les fonctionnalit&#233;es ne sont pas impl&#233;ment&#233;es. Le nom du serveur est cod&#233; en dur dans l&#39;application et il n&#39;y a pas possibilit&#233; de g&#233;n&#233;rer le certificat de signature. Seul les fichiers MSI sont pris en charge. Aucun rapport n&#39;est disponible.</div><div class="ClearBoth"></div>