Repository: DCourtel/Wsus_Package_Publisher
Catalog: sourceCode/Wsus Package Publisher/FrmUpdateInformationsWizard.*.resx
Languages: de, ru

# label1.Text
source: Vendor Name :
de: Hersteller:
ru: Производитель :

# label2.Text
source: Product Name :
de: Produkte:
ru: Имя продукта :

# label3.Text
source: Title :
de: Titel:
ru: Заголовок :

# label4.Text
source: Description :
de: Beschreibung:
ru: Описание :

# label5.Text
source: More info URL :
de: Weitere Informationen:
ru: URL с инормацией :

# label6.Text
source: Support URL :
de: Supportinformationen:
ru: URL поддержки:

# label7.Text
source: KB Article Id :
de: KB-Artikelnummern:
ru: Id статьи KB :

# label8.Text
source: Return Codes :
ru: Возвращаемые коды :

# label9.Text
source: Update Classification :
de: Klassifizierung:
ru: Тип обновления :

# label10.Text
source: Impact :
de: Auswirkungen:
ru: Взаимодействие :

# label11.Text
source: Reboot Behavior :
de: Neustartverhalten:
ru: Перезагрузка :

# chkBxCanRequestUserInput.Text
source: Can request User Input
de: Benutzereingabe ermöglichen
ru: Может требовать действий пользователя

# chkBxRequiresNetworkConnectivity.Text
source: Requires Network Connectivity
de: Benötigt eine Netzwerkverbindung
ru: Требует подключения к сети

# label13.Text
source: Msrc Severity :
de: MSRC Schweregrad:
ru: Важность Msrc :

# btnNext.Text
source: &Next
de: &Weiter
ru: &Далее

# btnCancel.Text
source: &Cancel
de: &Abbrechen
ru: О&тмена

# btnPrevious.Text
source: &Previous
de: &Zurück
ru: &Назад

# label14.Text
source: Security Bulletin Id :
ru: Id биллютеня безопасности :

# label15.Text
source: Command Line :
de: Befehlszeile:
ru: Командная строка :

# label16.Text
source: Optional : Provide Command Line like /q, /s, /silent...
de: Optional: Befehlszeilenoptionen wie /q, /s, /silent... angeben
ru: Дополнительно : Укажите команду, например /q, /s, /silent...

# Value.HeaderText
source: Value
de: Wert
ru: Значение

# Result.HeaderText
source: Result
de: Ergebnis
ru: Результат

# NeedReboot.HeaderText
source: Need Rebbot
de: Reboot erforderlich
ru: Необходима перезагрузка

# label17.Text
source: Supersedes :
de: Ersetzt:
ru: Замещает :

# label18.Text
source: Prerequisites :
de: Voraussetzungen:
ru: Зависимости :

# label19.Text
source: Package Type :
ru: Тип пакета :

# $this.Text
source: FrmUpdateInformationsWizard
de: Update Erstellungs-Assistent
ru: Мастер информации об обновлении
