<div class="wikidoc"><a href="https://wsuspackagepublisher.codeplex.com/wikipage?title=History&referringTitle=Home">History</a> - <a href="https://wsuspackagepublisher.codeplex.com/wikipage?title=Screenshots&referringTitle=Home">Screenshots</a><br />
<h2>Free Tool for Publishing Third-Party Updates or Applications to Wsus</h2>
<u>Now works with Wsus 6.2, 6.3 and 10 (Windows Server 2012, 2012R2, and 2016)</u><br /><br /><b>Project Description : </b><br /><b>English : </b><br />Wsus Package Publisher allows you to publish your own updates as MSI, MSP or EXE files. Hence, you can deploy applications like Adobe Reader, Java, Flash Player or Symantec Endpoint Protection 12.1. and update them.<br /><br />You can import updates from vendor catalogs like Dell, HP and Fujitsu to publish hardwareupdates like drivers or new BIOS versions to your servers and PCs.<br /><br />You must have a WSUS infrastructure installed and running to use this application. With this application you can:<br />- Publish<br />- Approve <br />- Delete <br />- Review <br />... updates.<br />You can also generate reports to track the status of installation of updates.<br />You can even find computers that are in AD but not in Wsus.<br /><br /><b>Fran&#231;ais : </b><br />Wsus Package Publisher permet de publier vos propres mises &#224; jour sous forme de fichiers MSI, MSP ou EXE. Ainsi, vous pouvez d&#233;ployer des applications telles qu&#39;Adobe Reader, Java, Flash Player ou Symantec Endpoint Protection 12.1. Et les mettre &#224; jour.<br /><br />Vous pourrez importer des mises &#224; jour &#224; partir de catalogues d&#39;&#233;diteur (Adobe, Dell, HP...). Afin de publier des pilotes ou firmware pour votre mat&#233;riels.<br /><br />Vous devez avoir une infrastructure WSUS install&#233;e et fonctionnelle pour pouvoir utiliser cette application.<br />Avec cette application vous pourrez :<br />- Publier<br />- Approuver<br />- Supprimer<br />- R&#233;viser...<br />... des mises &#224; jour.<br />Vous pourrez &#233;galement g&#233;n&#233;rer des rapports pour suivre l&#39;&#233;tat d&#39;installation des mises &#224; jour.<br />Vous pouvez m&#234;me voir les ordinateurs qui sont dans Active Directory mais absent de Wsus.<br /><br /><b>Deutsch: </b><br />WSUS Package Publisher erm&#246;glicht es Ihnen, eigene Updates als MSI, MSP oder EXE Dateien zu ver&#246;ffentlichen. So k&#246;nnen Sie bspw. Adobe Reader, Java, Flash Player oder Symantec Endpoint Protection 12.1 verteilen und aktualisieren.<br /><br />Importieren Sie Updates aus den Herstellerkatalogen von Dell, HP oder Fujitsu. Damit ist es m&#246;glich, Hardwareupdates (Treiber, Bios, u.a.) an Server und PCs zu verteilen.<br /><br />Ben&#246;tigt wird eine installierte und funktionsbereite WSUS Infrastruktur. Mit dieser Anwendung k&#246;nnen Sie Updates:<br />- ver&#246;ffentlichen<br />- genehmigen<br />- l&#246;schen<br />- &#252;berpr&#252;fen<br /><br />Generieren Sie Reports, um einen &#220;berblick &#252;ber den Status der Installation von Updates zu erhalten. Erkennen Sie Computer, welche sich in Ihrem Active Directory befinden, aber nicht im WSUS.<br /><br /><b>Portugu&#234;s Brasileiro:</b><br />O Editor de Pacotes WSUS permite que voc&#234; publique suas pr&#243;prias atualiza&#231;&#245;es de arquivos MSI, MSP ou EXE. Assim, voc&#234; pode implantar aplicativos, como o Adobe Reader, Java, Flash Player ou o Symantec Endpoint Protection 12.1. e atualiz&#225;-los.<br /><br />Voc&#234; pode importar as atualiza&#231;&#245;es de cat&#225;logos de fornecedores como Dell, HP e Fujitsu para publicar as atualiza&#231;&#245;es de &quot;hardware&quot; assim como &quot;drivers&quot; ou novas vers&#245;es da BIOS para os seus servidores e computadores.<br /><br />Voc&#234; deve ter uma infra-estrutura com o WSUS instalado e funcionando para usar este aplicativo. Com este aplicativo voc&#234; pode:<br />- Publicar<br />- Aprovar<br />- Excluir<br />- Revisar<br />... atualiza&#231;&#245;es.<br />Voc&#234; tamb&#233;m pode gerar relat&#243;rios para acompanhar o status de instala&#231;&#227;o de atualiza&#231;&#245;es.<br />Voc&#234; pode at&#233; achar computadores que est&#227;o no AD, mas n&#227;o no WSUS.<br /><br /><b>Русский: </b><br />Wsus Package Publisher позволяет Вам опубликовывать Ваши собственные обновления в формате MSI, MSP или EXE. Благодаря этому, Вы можете развертывать такие приложения, как Adobe Reader, Java, Flash Player или Symantec Endpoint Protection 12.1., а так же обновлять их.<br /><br />Вы можете импортировать пакеты обновлений из каталогов производителей, таких как Dell, HP и Fujitsu чтобы опубликовывать обновления ПО для оборудования, например драйверы или новые версии BIOS для Ваших серверов и настольных компьютеров.<br /><br />Вы должны иметь установленную и настроенную инфраструктуру WSUS чтобы использовать это приложение. С этим приложением Вы сможете:<br />- Опубликовывать<br />- Утверждать<br />- Удалять <br />- Проверять<br />... обновления.<br />Вы так же можете создавать отчеты для отслеживания статуса устанавленных обновлений.<br />Вы даже можете найти компьютеры, которые входят в AD, но не используют WSUS.<br /></div><div class="ClearBoth"></div>